{"data":[{"title":"404 Not Found","url":"/404.html","content":"\n    \n\n\n\n    Image from https://http.cat.\n\n"},{"title":"About","url":"/about/","content":"\n\n\nAbout Me\n\n学生党, 新鲜韭菜, 野生Arch Linux用户一枚\n\n咱喜欢的游戏: Minecraft Java Edition, NieR:Automata, NieR:Replicant, Detroit: Become Human, Portal全系列; 除此之外咱还玩过Overwatch, PUBG, FGO, Don't Starve, 崩坏3等。\n\n咱喜欢的动漫/电影: 空之境界剧场版（推荐空境原著）、FSN &amp; FZ全系列、某科学的超电磁炮、君主·埃尔梅罗二世事件簿 魔眼收集列车 Grace note、声之形、秒速5厘米、利兹与青鸟、狼与香辛料。\n还看过格莱普尼尔、黑执事、几集新世纪福音战士和宝石之国和魔法禁书目录、我们从未知道那天所见的花的名字等。\n\n月厨, 空境剧场版看过无数遍, 原著看过一次后打算有时间再看一遍, 第一次读原著好多东西都没有看懂, FGO玩不懂算是个假月厨吧。\n\n咱喜欢摄影，有一台入门级半画幅单反，适马17-50mm f2.8和佳能50mm f1.8镜头。\n\n听歌种类略杂, 很少听华语。喜欢的歌以ACG系列为主, 首选Kalafina和梶浦由記的曲子以及尼尔/龙背系列。尽管不是东方厨但是东方的歌确实好听, 除此之外还听电音和轻音乐。\n\n常用Apple Music, 因为Apple Music有Kalafina的版权, 除此之外还经常用网易云音乐查找歌曲以及听日推\n\n偶尔在B站水视频, 是一名没有几个粉丝、几个月一更新的那种年更UP主, 不追求播放量和粉丝数,有人喜欢就很开心了。\n\n社交恐惧, 拖延, 情商低, 自我设障, 不过都太复杂了咱自己也讲不清楚（也不想弄清楚了, 不爱说话是真的\n\n不擅长交流，有些太复杂的东西又很难用文字表达出来\n\n不擅长制定并执行计划, 喜欢压力, 擅长拖延。\n\n菜, 很菜, 非常菜, 还懒, 不想努力, 肥, 宅, 新手, 不萌, 丑, 接近于废物一个。\n\n睡觉 睡觉 睡觉 睡觉 睡觉 睡觉 ZZZZZZZ~\n\n\nSTARRY-S' Blog\n建于2016年8月21日, 曾用域名starry-s.me、starry-s.xyz、starry-s.com和starry-s.cn。\n现用域名为starry-s.moe, 至于更换至moe域名的原因请看这篇博客。\n本站由Hikaru生成, 主题为ARIA, 托管于GitHub Pages（见页面右下角）, 很喜欢这个生成器以及ARIA这款主题。\n\n \n\n\nconst ap0 = new APlayer ({\n    container: document.getElementById(\"aplayer0\"),\n    theme: \"#33363b\",\n    fixed: false,\n    listFolded: false,\n    listMaxHeight: false,\n    lrcType: false,\n    mini: false,\n    volume: 0.7,\n    order: \"list\",\n    loop: \"all\",\n    autoplay: false,\n    audio: [{\n        name: \"尼尔机械纪元 Nier Automata - Soundtrack Medley\",\n        artist: \"Animenz\",\n        url: \"https://music.starry-s.moe/music/0f0e_0758_070b_8de6859a81025aae1e540aed59439f48.m4a\",\n        cover: \"https://music.starry-s.moe/music/cover/109951163092751719.jpg\",\n        lrc: \"\",\n        theme: \"#F6890E\"\n    }]\n});\n \n\n\n写于2020年8月16日凌晨, 随时更新。\n\n"},{"title":"归档","url":"/archives/","content":""},{"title":"分类","url":"/categories/","content":""},{"title":"首页","url":"/","content":""},{"title":"标签","url":"/tags/","content":""},{"title":"聊聊近期本站发生的事情","url":"/posts/daily-2021-07-15/","content":"又到了暑期该给域名续费的时间了，然而一顿误操作把原域名给删掉了。\n\n\n\n起因\n在收到提醒我续费域名的邮件之后，我在7月3号登录 NameSilo 交了16.99美元给我的.me域名续费。在缴费成功且收到付款的 invoice 邮件后，我就以为域名续费成功了然后就干别的事情去了。\n因为月初到9号一直有工训（工程训练），每天都要穿大一时留下的军训服到学校的工训楼那边学一些机床、电钻、机械这类的东西\n（容我短暂吐槽一下，真搞不懂计算机专业的为啥还要搞这个又累又耽误时间，而且有的机器岁数看着都比我还大，搞不好还会把人弄伤，尤其是运气贼好在工训的最后一天排到了普车的某老师，态度差就不说了，还让我们把苦累活全干完了）\n所以我没有太多时间用电脑整理博客这些东西（懒）。\n工训结束后有些事情需要回家一趟，然后收到了 NameSilo 发来的域名还有7天就到期的邮件。然而当时就很疑惑我几天前就已经充过钱了为啥还说我域名没有续费。\n到家后因为没带电脑所以用的 iPad 访问 NameSilo 打开 Billing 页面确认了一下确实是我充过钱但是域名没有被续到2022年。\n然后我又付了一遍16.99美元，这次确认了我的域名被成功续到了2022年。\n然而几天前充的16.99美元因为超过了3天的退款时间，所以我联系了客服，确定了我的域名被续到了2022年之后，把我刚刚缴的16.99美元申请退款。\n因为NameSilo有规定是在续费订单申请退款之后，域名也将被删除，所以一通操作之下我第一次缴费的16.99美元没退回来，域名也没了，还收了我第二次续费退款的几块钱手续费。\n（怪我英语不好没读懂退款的注意事项......）\n结果\n我知道上面的内容读起来很乱，但是这件事情还是有必要讲出来，还是解释清楚较好，不然会引起一些不必要的麻烦。\n所以我又不得不买了个.moe域名，把我的网站全迁到新域名上。新域名就多了一个字母‘o’，意思同日语的‘萌’。\n因为在家那几天没有电脑，我总不能现借电脑给TF卡烧镜像然后拿树莓派更新我的博客吧，所以本站的主页在12号那天有几个小时无法访问。\n然后音乐播放器的链接直到今天15号更新后才恢复正常。\n因为.me域名已经被 NameSilo 等待删除了，所以我没办法再弄个302重定向到新的域名上去，所以可能有些人不知道本站更换了新的域名。（尽管本站的访问量极少，估计没几个人看）\n等.me域名被删除之后，如果没有被其他人抢注，我还可以购买的话，到时候看情况搞个302重定向吧。\n所以本站底部的访问量又要从0开始统计了。\n\nSTARRY-S\n"},{"title":"《空之境界》摘抄","url":"/posts/karanokyokai/","content":"\n\n很久以前就打算二刷空境原著了，由于种种原因进展一直比较缓慢。\n最终在 Kindle (泡面盖) 上阅读时标记了一些不错的菌言菌语，整理到博客上。\n\n\n\n \n\n\nconst ap0 = new APlayer ({\n    container: document.getElementById(\"aplayer0\"),\n    theme: \"#33363b\",\n    fixed: false,\n    listFolded: false,\n    listMaxHeight: false,\n    lrcType: false,\n    mini: false,\n    volume: 0.7,\n    order: \"list\",\n    loop: \"all\",\n    autoplay: false,\n    audio: [{\n        name: \"Oblivious\",\n        artist: \"Kalafina\",\n        url: \"https://music.starry-s.moe/music/obj_w5rDlsOJwrLDjj7CmsOj_8776653719_722d_c783_516e_072d631639c3a9e51d99be99dfae261f.m4a\",\n        cover: \"https://music.starry-s.moe/music/cover/Kalafina All Time Best 2008-2018 small.jpg\",\n        lrc: \"\",\n        theme: \"#7c7c7c\"\n    }]\n});\n \n\n俯瞰风景\n\n飞行这个名词，与坠落这个名词是相连结的。但越是迷恋天空的人，越会欠缺这样的认知，结果死了之后也只能持续朝云端飞行，不会往地面坠落下来，等于是朝着天空坠落。\n\n视野并不是眼球看到的景象，而是大脑处理过的景象。我们的视野受到我们的常识保护着，不认为自身的高度叫高，甚至觉得是种常识，没有高这个概念存在。反过来说，凡是人类，都活在俯瞰的视野中。\n\n人是活在箱中的生物，也只能在箱中生活。\n\n在这短暂存在的密室里，现在无论外界发生什么事都与式没有关联，也无法产生关联。这份实际感受，微微沁入她本应空虚的心。\n\n——如果自身的视野就是世界的一切，此刻世界的确正在沉睡。\n\n如果城市是深海，夜空就是纯粹的黑暗。在那片黑暗上，星辰就像散落的宝石那般闪闪发光。月亮是洞穴，一个凿穿夜空这张黑色图画纸的巨大洞穴。\n\n月亮其实不是反射太阳的镜子，只是在窥视这一侧的景色——在两仪家，式曾听人这么说过。\n\n一头宛如以一根根丝线梳就的黑发顺滑无比，只要风势一大，黑发迎风飞舞的模样就散发出无比幽玄之美。\n\n刀刃有六寸长，与其说是刀更像是一柄只由白刃构成的凶器。\n\n因为天空没有尽头。我认为如果能无拘无束的漫游、能自由飞往任何地方，就可以找到我不讨厌的世界。\n\n所谓的 ‘逃’ 有两种，漫无目的的逃以及带有目的的逃。一般将前者称为 ‘漂浮’，后者称为 ‘飞行’。\n\n我们并不是根据背负的罪来选择道路，而是先选择道路再背负起自己的罪孽。\n\n虽然根本不值得一提，我终究认为自己最后还是应该死于从俯瞰坠落。\n\n无论当事人下了什么决定，自杀还是会被视为自杀来处理。\n\n\n\n杀人考察（前）\n\n人要无知一点比较好，黑桐。人在小时候只看得到自己，根本不会察觉别人的恶意。就算是污秽也好，当被爱的感觉转化成经验，人才能够以善意去对待他人——因为人只能展现本身已具有的情感。\n\n你要当心点，黑桐同学。不详的预感，会招来不详的现实\n\n\n\n痛觉残留\n\n无法适应社会的人非常多，他们的存在本身却从一开始就无法适应这个社会。他们不应该存在，不，是无法存在。\n\n这让她很高兴。因为活下去，就等于痛苦下去。\n\n被排除在境界之外的人，也会被彻底剥夺其存在意义。所以，那只不过是肉块罢了。\n\n对于想不通的事，不要强迫自己接受比较好。\n\n因为缺乏感觉的人一样拥有身体，也能够移动自如，我们就认为他们除了没有感觉之外没什么不同。但这是错误的。没有感觉，就代表什么都接收不到喔，黑桐。\n\n黑桐没能赶上是吗？接下来，就看暴风雨是先抵达，还是先被制造出来。式一个人去，有可能反被打败啊，两仪。\n\n痛觉可是种好东西，有错的终究是伤口，不可以搞错先后顺序。我们需要痛觉，无论多么痛苦都一样。\n\n“没有什么伤是无法痊愈的。不会痊愈的伤口不叫伤口，叫作死亡。”\n\n\n\n伽蓝之洞\n\n“没错，你无法过着正常生活。要烦恼也该有个限度，两仪式，你该认清现实了。你原本就是属于我们这边的人吧？ 所以——别再梦想什么普通（幸福）的生活了。”\n\n这女的——真是专挑我逃避的问题刺人痛楚。\n\n\n\n矛盾螺旋\n\n所谓的变成大人，就是明智的将幻想取代。\n\n追求社会上理所当然的生活就得遭受打击。只要接受我的人生注定如此，就不会觉得自己不幸。这和小时候一样。我以聪明代替幻想，决定一个人活下去。\n\n这家伙以前曾说心是看不见的。因此，她绝不会对别人吐露肉眼看不见的烦恼。\n\n忍耐明明是你的优点，结果你却选择了痛苦的那条路。第一次见面的时候，胭条巴正要抹杀胭条巴。失去未来，变成空壳的你，也跟现在一样想死是吗？\n\n或许，她就是将如暗处鲜花般优美的日本幽灵，与外国童话中的妖精融合而成的结晶。\n\n“和他们结识，算是我在伦敦时唯一的疏忽吧。”\n\n灵长已经变得太复杂，是过度追求万能，替生命附加种种能力导致的结果。\n\n朦胧不定的东西会召唤朦胧不定的言语。事情明明这么简单，方才的平稳气息却已散去，让人难以呼吸。\n\n由于没有任何一点小的异常，所以也就注意不到大的异常。\n\n若不在人们身上使用相同的仪式死亡，给你的献祭便不完全。如果死亡之后再次复活的螺旋不完全。没有达到相互交缠且相克的条件，便无法将其联系起来。于是我便准备了他们的尸体作为阴，他们平常的生活作为阳。\n\n死者与生者无法兼容。在满是矛盾的这个世界中，个体是没有共通这层意义的。\n\n第一次脱离了死的困境，但那只不过是为了迎接第二次、第三次的死所注定的方法。这种有限的死的方式。\n\n为了消除现象而引起的现象，最终会变成将自己向绝境逼迫的行为。但是果然，即使留下最初的现象不管，也会演变成被逼迫至绝境的情形。无论怎样努力，现象这个词的含义是不会消失的。\n\n由于事物总是连带有许多阻碍，所以并不存在完美的事物。\n\n“学问和年龄无关，柯尼勒斯，虽然你外表看起来很年轻，但你总是只注意外表，所以内在才会追不上啊。”\n\n让一个人了解事物，与其教他，不如让他自己体验来得快。\n\n生命的证据不是如何去追求快乐，因为生命的意义，就是要去体会痛苦。\n\n但那也是不可能的，扭曲的轮回不会在同一个地方转动，若死者不能亲自结束身为死者的存在，日常生活永远不会到来。\n\n\n\n忘却录音\n\n事情就是因为有尽头，所以才能观测到无限这件事。\n\n在确认自己的记忆时，不可以依靠他人的记忆。毕竟只有名为回忆的自我天平，才能决定过去......\n\n所谓的忘记，其实是记忆劣化。回忆是一种不会消失、只会逐渐褪色的废弃物。你不觉得很可惜吗？人们竟然让属于永恒的事物生锈。亲手让身为永恒的事物化为烟尘。\n\n污秽由污秽自己解决是最好的作法，因为不管是什么人，想要清除污秽，就一定会受到污秽沾染，这是一个不详的循环，我们称之为 ‘诅咒’。\n\n所谓的天才，到最后只是把自己当成对手。\n\n妖精很难控制，操纵者常常在不知不觉间，从实现他们自己的愿望变成实现妖精的愿望。鲜花你听清楚了，要注意——使用自己以外的东西所制造出来的使魔，别走到操纵者反被操纵的下场\n\n我的能力只能从别人已经走过的道路来获得信息，但你却可以看到接下来的路通往哪里呢......\n\n人之所以选择忘却记忆，绝不是因为那些记忆没有必要，而是因为记住那些事很危险。\n\n我们刻意忘却过去犯下的种种过错。忘却那些如果记得就会让自己崩溃的记忆。我们靠着这么做——才能守护自己现在是健康而无辜的幻象。\n\n“物质是用来消费及磨耗的事物，这个名为地球的世界逐渐走向崩坏也是自然的道理，因为在最后走向死亡是最正确的存在方式，所以谁也不会去解决这个问题。对我们来说，真正的世界只存在于各自的脑髓中而已。”\n\n\n\n杀人考察（后）\n\n本能在表层意识具现化成人格时，将会驱逐所有理性，会凌驾我这个名为白纯里绪的人格。\n\n向对方抱有的情感，超出自己的容许量的时候吧，自己能承受的感情量是一定的，有些人容量很大，也有人容量很小，不论是爱情或者是憎恨，当那种感情超过自己所能容纳的量，那么超出的部分会转变为痛苦，如此一来，便不能忍受对方的存在。\n\n为了到最后让自己死去，所以我们只有杀一次人的权利。\n\n人一辈子只能承受一人份的人生价值，为了原谅无法走到尽头的人生，所以大家才会用尊重的态度看待死亡，因为生命等价，即使是自己的生命，也不是自己所拥有的东西。\n\n光是孕育意识的大脑，无法产生人格。虽然只有脑部也可以活下去，但我们必须先拥有肉体才能产生自我意识。有了肉体之后，和肉体一起培养，就有了现在的人格。喜爱自己肉体的人，应该属于社交型人格，而厌恶自己肉体的人，则属于内向型人格。虽然光有意识也可以培养出人格，但那样的人格是无法认识自己的，一般来说，心灵就会长成特别的东西。那样的话，已经不能称之为人格，和计算机没有什么不同。如果有谁只是一个大脑，那个人就必须创造出一个 ‘只有脑的自己’ 的人格。必须舍弃肉体这个大我，而保存意识这个小我。\n\n“不是有了知性才有肉体。”\n“而是，有了肉体之后，知性才得以诞生。”\n\n说到底，人类只不过是在自己这个空壳中做着梦而已。明明是那么地显而易见的。\n\n大部分的人并不是出于自己的愿望要过那样的生活。想要成为特别的存在却无法实现，这种形式才是真正的平凡人生。\n\n\n\n未来福音\n\n她擅长的并非预测未来，而是教人如何避免遭遇到不幸。\n\n那是一种希望，希望对方相信她说的话。也是一种绝望，绝望于对方不可能相信。\n\n所谓的现实，即为数值尚未确定的公式。公式的数值会不断变动，不用说是求出答案，人们连要求出什么都不知道。然而——一旦这个数值确定下来，答案便再也不会改变。\n\n这一切都是醒着的，但没有什么活着的样子。没有任何例外。\n\n“就是因为知道得太清楚，才会看不见吗——橙子说得对极了。炸弹魔，你有没有听到？既然你的眼睛什么都没看见，不如废了算了。”\n\n“未来并没有不同。‘未来’这种东西，一开始便不存在。不存在的东西，当然没有办法控制。”\n\n她依然是老样子，即使自己遇到不幸，也没有显露出来，仍旧表现得潇洒又懒惰，完全就是时下高中女生会有的样子。\n\n“没错。那顶多算是憧憬。你就像个看到偶像，拼命叫个不停的幸福小粉丝。所谓的恋爱啊，应该要更轰轰烈烈、更不堪回首、更捉摸不定，如同不是抵达终点，便是发生意外的云霄飞车。总之啊，谈恋爱不可能留下什么美好回忆......”\n\n“我漂亮地踩到地雷。”\n\n既然我可以用未来视取巧，相对地当然要承担一些代价。\n\n不论谁看见她，都会期待她未来的发展，另一方面，又暗暗希望她永远维持现在的样子\n\n在这个时代，幸福的未来相当罕见。\n\n既然看得见未来，当然也会了解过去。\n\n这十年——不，说得更正确，是十二年来，我始终像故事中模仿人类的机器人，融入这个城市的生活罢了。\n\n我遇见难得的朋友，之后又失去他。尽管试着承续他的衣钵，却每天被唯一的读者批评。\n\n尽管我也为此付出代价，往后的人生满是失败。但我至少还留有什么。\n\n“你很快会从这个世界上消失。你的前途一片漆黑，未来完全没有任何希望。你不会留下任何东西，也没有获救的可能......但是，太不可思议了，尽管如此，你的梦想将继续活下去。”\n\n\n\n"}]}