<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
    <meta name="theme-color" content="#19323c">
    <meta name="msapplication-TileColor" content="#19323c">
    
    
    
    <meta name="keywords" content="Life, ARIA, Hikaru, STARRY-S">
    
    
    <link rel="apple-touch-icon" sizes="180x180" href="/favicons/apple-touch-icon.png">
    
    
    <link rel="icon" type="image/png" sizes="192x192" href="/favicons/android-chrome-192x192.png">
    
    
    <link rel="icon" type="image/png" sizes="32x32" href="/favicons/favicon-32x32.png">
    
    
    <link rel="icon" type="image/png" sizes="16x16" href="/favicons/favicon-16x16.png">
    
    
    <link rel="mask-icon" href="/favicons/safari-pinned-tab.svg" color="#19323c">
    
    
    <link rel="manifest" href="/favicons/site.webmanifest">
    
    
    <meta name="msapplication-config" content="/favicons/browserconfig.xml">
    
    
    <link rel="shortcut icon" type="image/x-icon" href="/favicons/favicon.ico">
    
    
    <link rel="alternate" href="/atom.xml" title="STARRY-S' Blog" type="application/atom+xml" />
    
    
    <link rel="stylesheet" type="text/css" href="/css/normalize.css">
    <link rel="stylesheet" type="text/css" href="/css/index.css">
    
    <link rel="stylesheet" type="text/css" href="/css/sidebar.css">
    
    
<link rel="stylesheet" type="text/css" href="/css/page.css">
<link rel="stylesheet" type="text/css" href="/css/post.css">

    <link rel="stylesheet" type="text/css" href="/css/custom.css">
    <link rel="stylesheet" type="text/css" href="/css/atom-one-dark.css">
    <link rel="stylesheet" type="text/css" href="/css/lightgallery.min.css">
    <script type="text/javascript" src="/js/jquery.min.js"></script>
    <script defer type="text/javascript" src="/js/util.js"></script>
    <script defer type="text/javascript" src="/js/scrollspy.js"></script>
    <script defer type="text/javascript" src="/js/fontawesome-all.min.js"></script>
    <script defer type="text/javascript" src="/js/lightgallery.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-fullscreen.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-hash.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-pager.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-thumbnail.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-zoom.min.js"></script>
    
    <script defer src="/js/busuanzi.pure.mini.js"></script>
    
    
    <script defer type="text/javascript" src="/js/search.js"></script>
    <script type="text/javascript">
    $(document).ready(function () {
      var searchPath = "/search.json";
      if ("search.json".length === 0) {
        searchPath = "/search.json";
      }
      searchFunc(searchPath, "search-input", "search-result");
    });
    </script>
    
    
    <script defer type="text/javascript" src="/js/index.js"></script>
    
    <script defer type="text/javascript" src="/js/custom.js"></script>
    <title>山地车刹车换血 | STARRY-S' Blog - Lifeline</title>
  </head>
  <body itemscope itemtype="http://schema.org/WebPage" lang="en"  data-spy="scroll" data-target=".list-group">
    
<header id="header" class="header" style="background: #19323c;">
  <div class="container">
    <div class="header-container">
      <div class="header-title">
        <h1 class="title"><a href="/">STARRY-S' Blog</a></h1>
        <h2 class="subtitle">Lifeline</h2>
      </div>
      
      <div class="logo">
        <img src="/images/logo.png" alt="logo">
      </div>
      
    </div>
    <nav id="nav" class="nav">
      <a id="nav-toggle" class="nav-toggle" aria-hidden="true"><i class="fas fa-bars" aria-label="Toggle Navbar"></i></a>
      <ul id="menu" role="menubar" aria-hidden="false">
        
        <li role="menuitem"><a href="/"><i class="fas fa-home"></i><span class="menu-text">Home</span></a></li>
        
        <li role="menuitem"><a href="/archives/"><i class="fas fa-archive"></i><span class="menu-text">Archives</span></a></li>
        
        <li role="menuitem"><a href="/categories/"><i class="fas fa-th-list"></i><span class="menu-text">Categories</span></a></li>
        
        <li role="menuitem"><a href="/tags/"><i class="fas fa-tags"></i><span class="menu-text">Tags</span></a></li>
        
        <li role="menuitem"><a href="/about/"><i class="fas fa-user-edit"></i><span class="menu-text">About</span></a></li>
        
      </ul>
    </nav>
  </div>
</header>


    <main id="main" class="main">
      <div class="container">
        <div class="main-container">
          <div class="content">
            
<div id="post" class="page">
  <article class="article post card" itemscope itemtype="http://schema.org/Article">
    <div class="post-block">
      <link itemprop="mainEntityOfPage" href="https://blog.starry-s.xyz/brake-bleed.html">
      <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
        <meta itemprop="name" content="STARRY-S">
        <meta itemprop="description" content="A blog of a common student.">
        <meta itemprop="image" content="/images/avatar.jpg">
      </span>
      <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
        <meta itemprop="name" content="STARRY-S' Blog">
      </span>
    </div>
    <header class="post-header">
      <h1 class="post-title" itemprop="name headline">山地车刹车换血</h1>
      <div class="post-meta">
        
        <span class="post-date meta-block">
          <i class="far fa-calendar-plus"></i><span><time title="post-date" itemprop="dateCreated datePublished" datetime="2017-01-24T06:57:44.000Z">2017-01-24 14:57:44</time></span>
        </span>
        
        
        <span class="post-categories meta-block">
          
          <i class="far fa-folder-open"></i><span itemprop="about" itemscope itemtype="http://schema.org/Thing"><a href="/categories/%E5%B1%B1%E5%9C%B0%E8%BD%A6/" itemprop="url" rel="index"><span itemprop="name">山地车</span></a></span><i class="fas fa-angle-right"></i><span itemprop="about" itemscope itemtype="http://schema.org/Thing"><a href="/categories/%E5%B1%B1%E5%9C%B0%E8%BD%A6/%E5%B1%B1%E5%9C%B0%E8%BD%A6%E6%B2%B9%E5%88%B9%E6%8D%A2%E6%B2%B9/" itemprop="url" rel="index"><span itemprop="name">山地车油刹换油</span></a></span>
        </span>
        
        
        
        
      </div>
    </header>
    <main class="post-main" itemprop="articleBody">
      <p>&#x8FD9;&#x662F;&#x4E00;&#x7BC7;&#x4E0D;&#x592A;&#x6B63;&#x7ECF;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x5185;&#x5BB9;&#x4E0E;&#x8BA1;&#x7B97;&#x673A;&#x4EE5;&#x53CA;&#x6B63;&#x5E38;&#x751F;&#x6D3B;&#x4E2D;&#x6240;&#x80FD;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#x5168;&#x90FD;&#x65E0;&#x5173;&#xB7;&#xB7;&#xB7;&#xB7;&#xB7;&#xB7;
&#x524D;&#x51E0;&#x5929;&#x6211;&#x7684;&#x5BE8;&#x8F66;&#x53C8;&#x4E00;&#x6B21;&#x7684;&#x7C97;&#x6BDB;&#x75C5;&#x4E86;&#xFF0C;&#x8D77;&#x56E0;&#x662F;&#x5239;&#x8F66;&#x6765;&#x4EE4;&#x7247;&#x6CBE;&#x6CB9;&#x53D1;&#x51FA;&#x4E86;&#x9A74;&#x53EB;&#x58F0;@(&#x4E0D;&#x9AD8;&#x5174;)&#xFF0C;&#x66F4;&#x6362;&#x789F;&#x7247;&#x548C;&#x6765;&#x4EE4;&#x7247;&#x540E;&#x53D1;&#x73B0;&#x6CB9;&#x5239;&#x6F0F;&#x6CB9;&#x8FDB;&#x6C14;&#x4E86;&#x6700;&#x7EC8;&#x5BFC;&#x81F4;&#x5239;&#x8F66;&#x6BEB;&#x65E0;&#x529B;&#x6C14;&#xFF0C;&#x597D;&#x4F3C;&#x6DB2;&#x4F53;&#x88AB;&#x638F;&#x7A7A;&#xB7;&#xB7;&#xB7;@(&#x55B7;)
&#x6CB9;&#x5239;&#x6362;&#x6CB9;&#x662F;&#x552F;&#x4E00;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x4E86;&#xFF08;&#x571F;&#x8C6A;&#x53EF;&#x4EE5;&#x4E70;&#x65B0;&#x7684;&#x5239;&#x8F66;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E00;&#x9635;&#x5B50;&#x53C8;&#x4E00;&#x6B21;&#x7684;&#x548C;&#x81EA;&#x884C;&#x8F66;&#x8F6E;&#x80CE;&#x6765;&#x4E86;&#x4E2A;&#x4EB2;&#x5BC6;&#x63A5;&#x89E6;&#xB7;&#xB7;&#xB7;&#xB7;&#xB7;&#xB7;
&#x6362;&#x597D;&#x6CB9;&#x540E;&#x60F3;&#x4E86;&#x60F3;&#x8FD8;&#x662F;&#x628A;&#x8FC7;&#x7A0B;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#x5427;&#xFF0C;&#x4EE5;&#x540E;&#x4E00;&#x65E6;&#x81EA;&#x5DF1;&#x9700;&#x8981;&#x518D;&#x6B21;&#x6362;&#x6CB9;&#x65F6;&#x80FD;&#x5E2E;&#x5E2E;&#x81EA;&#x5DF1;&#x3002;</p>
<a id="more"></a>

<p><img src="https://blog.starry-s.xyz/images/brake-bleed/brake-bleed-kit.jpgshimano.jpg" alt="SHIMANO"></p>
<hr>
<p>&#x6211;&#x7528;&#x7684;&#x662F;&#x79A7;&#x739B;&#x8BFA;&#x5165;&#x95E8;&#x7EA7;&#x5239;&#x8F66;&#xFF0C;&#x73B0;&#x5728;&#x5927;&#x591A;&#x6570;&#x5E38;&#x89C1;&#x7684;&#x5C71;&#x5730;&#x8F66;&#x4E5F;&#x90FD;&#x5728;&#x7528;&#x8FD9;&#x6B3E;&#xFF0C;&#x578B;&#x53F7;&#x4E3A;&#x79A7;&#x739B;&#x8BFA;M355&#xFF0C;&#x6211;&#x7528;&#x7684;&#x6CB9;&#x662F;&#x79A7;&#x739B;&#x8BFA;&#x77FF;&#x7269;&#x8D28;&#x6CB9;&#x3002;
&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x662F;&#x9488;&#x5BF9;&#x79A7;&#x739B;&#x8BFA;&#x90E8;&#x5206;&#x7C7B;&#x578B;&#x7684;&#x5239;&#x8F66;&#x5199;&#x7684;&#xFF0C;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x5239;&#x8F66;&#x5C31;&#x4E0D;&#x8981;&#x4E71;&#x6309;&#x7167;&#x672C;&#x6559;&#x7A0B;&#x4E71;&#x5C1D;&#x8BD5;&#x4E86;&#x3002;</p>
<h1 id="&#x6240;&#x9700;&#x5DE5;&#x5177;&#xFF1A;"><a class="headerlink" href="/#%E6%89%80%E9%9C%80%E5%B7%A5%E5%85%B7%EF%BC%9A" title="&#x6240;&#x9700;&#x5DE5;&#x5177;&#xFF1A;"></a>&#x6240;&#x9700;&#x5DE5;&#x5177;&#xFF1A;</h1>
<p>1.&#x6362;&#x6CB9;&#x5DE5;&#x5177;&#x3002;&#xFF08;&#x6211;&#x4E70;&#x7684;&#x6613;&#x6377;EZ&#x6362;&#x6CB9;&#x5DE5;&#x5177;&#xFF0C;&#x7F51;&#x4E0A;&#x5F88;&#x591A;&#x90FD;&#x5728;&#x5356;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#xFF09;
2.&#x5239;&#x8F66;&#x6CB9;&#x3002;&#xFF08;&#x6280;&#x672F;&#x597D;&#x7684;&#x4EBA;50&#x6BEB;&#x5347;&#x5C31;&#x591F;&#x4E00;&#x6574;&#x8F66;&#x7684;&#x3002;&#xFF09;
3.&#x624B;&#x5957;&#xFF0C;&#x9632;&#x62A4;&#x5DE5;&#x5177;&#xFF0C;&#x6E05;&#x6D01;&#x5DE5;&#x5177;&#x3002;
4.&#x5185;&#x516D;&#x89D2;&#x6273;&#x624B;&#x4E00;&#x5957;&#x3002;&#xFF08;&#x4FBF;&#x5B9C;&#x5185;&#x516D;&#x89D2;&#x6273;&#x624B;&#x5BB3;&#x6B7B;&#x4EBA;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x4E70;&#x8D35;&#x7684;&#xFF0C;&#x4E0D;&#x7136;&#x5927;&#x529B;&#x51FA;&#x5947;&#x8FF9;</p>
<p>#&#x6ED1;&#x7A3D;&#xFF09;
5.&#x7A7A;&#x77FF;&#x6CC9;&#x6C34;&#x74F6;&#x7528;&#x6765;&#x5B58;&#x5E9F;&#x5F03;&#x7684;&#x6CB9;&#x3002;
**
&#x8BF4;&#x5B9E;&#x8BDD;&#x5F53;&#x5730;&#x7684;&#x8F66;&#x5E97;&#x633A;&#x5751;&#x7684;&#xFF0C;&#x4E00;&#x74F6;60ml&#x79A7;&#x739B;&#x8BFA;&#x77FF;&#x7269;&#x8D28;&#x6CB9;&#x5356;&#x6211;80&#x3002;&#x7ED9;&#x4ED6;&#x4E2A;&#x773C;&#x795E;&#x8BA9;&#x4ED6;&#x81EA;&#x5DF1;&#x4F53;&#x4F1A;&#x53BB;&#x5427;&#xB7;&#xB7;&#xB7;&#xB7;&#xB7;&#xB7;
**</p>
<p><img src="https://blog.starry-s.xyz/images/brake-bleed/brake-bleed-kit.jpgbleed-tools.jpg" alt="EZ" title="&#x6613;&#x6377;&#x6362;&#x6CB9;&#x5DE5;&#x5177;"></p>
<h1 id="&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#xFF1A;"><a class="headerlink" href="/#%E5%87%86%E5%A4%87%E5%B7%A5%E4%BD%9C%EF%BC%9A" title="&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#xFF1A;"></a>&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#xFF1A;</h1>
<p>&#x9996;&#x5148;&#x8111;&#x8865;&#x4E00;&#x4E9B;&#x5239;&#x8F66;&#x6362;&#x6CB9;&#x7684;&#x89C6;&#x9891;&#x3002;</p>
<p>&#x5148;&#x719F;&#x6089;&#x4E00;&#x4E0B;&#x5239;&#x8F66;&#x3002;&#x5239;&#x628A;&#x4E0A;&#x6709;&#x4E00;&#x4E2A;&#x5706;&#x5F62;&#x7684;&#x6CE8;&#x6CB9;&#x5B54;&#xFF08;&#x9700;&#x8981;&#x7528;&#x5230;2mm&#x6273;&#x624B;&#xFF09;&#xFF0C;&#x6309;&#x7167;&#x79A7;&#x739B;&#x8BFA;&#x5B98;&#x65B9;&#x63A8;&#x8350;&#x7684;&#x6362;&#x6CB9;&#x65B9;&#x6CD5;&#x8FD9;&#x91CC;&#x5728;&#x6CE8;&#x6CB9;&#x65F6;&#x9700;&#x8981;&#x5B89;&#x88C5;&#x6CE8;&#x6CB9;&#x6F0F;&#x6597;&#x3002;&#x5239;&#x8F66;&#x5939;&#x5668;&#x4E0A;&#x6709;&#x4E00;&#x4E2A;&#x6362;&#x6CB9;&#x5B54;&#xFF0C;
<strong>&#x6CE8;&#xFF1A;&#x79A7;&#x739B;&#x8BFA;M3XX&#x7CFB;&#x5217;&#x7684;&#x5239;&#x8F66;&#x7684;&#x5939;&#x5668;&#x4E0A;&#x7684;&#x6CE8;&#x6CB9;&#x5B54;&#x548C;&#x653E;&#x6CB9;&#x7684;&#x87BA;&#x4E1D;&#x662F;&#x5206;&#x5F00;&#x7684;&#xFF0C;&#x87BA;&#x4E1D;&#x9700;&#x8981;&#x5185;&#x516D;&#x89D2;&#x62E7;&#x5F00;&#xFF0C;&#x6CB9;&#x5B54;&#x85CF;&#x5728;&#x4E00;&#x4E2A;&#x9632;&#x5C18;&#x5E3D;&#x5185;&#x3002;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x5239;&#x8F66;&#x7684;&#x5939;&#x5668;&#x4E0A;&#x7684;&#x6CE8;&#x6CB9;&#x5B54;&#x548C;&#x653E;&#x6CB9;&#x87BA;&#x4E1D;&#x662F;&#x4E00;&#x4F53;&#x7684;&#xFF0C;&#x9700;&#x8981;&#x6273;&#x624B;&#x62E7;&#x5F00;&#x3002;</strong>
&#x653E;&#x6CB9;&#x548C;&#x6CE8;&#x6CB9;&#x548C;&#x6392;&#x6C14;&#x90FD;&#x9700;&#x8981;&#x8C03;&#x8282;&#x5939;&#x5668;&#x7684;&#x6CE8;&#x6CB9;&#x87BA;&#x4E1D;&#x3002;
<img src="https://blog.starry-s.xyz/images/brake-bleed/brake-bleed-kit.jpgIMG_20170122_213246.jpg" alt="&#x5939;&#x5668;&#x6CE8;&#x6CB9;&#x5B54;"></p>
<p>&#x6362;&#x6CB9;&#x524D;&#x9700;&#x8981;&#x5C06;&#x5239;&#x8F66;&#x5185;&#x7684;&#x6CB9;&#x5168;&#x90E8;&#x6392;&#x7A7A;&#xFF0C;&#x653E;&#x6CB9;&#x8FC7;&#x7A0B;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5BB9;&#x5668;&#x5C06;&#x6CB9;&#x6536;&#x96C6;&#x8D77;&#x6765;&#x907F;&#x514D;&#x6D41;&#x7684;&#x54EA;&#x90FD;&#x662F;&#x3002;&#x51C6;&#x5907;&#x4E24;&#x4E2A;&#x77FF;&#x6CC9;&#x6C34;&#x74F6;&#xFF0C;&#x5C06;&#x77FF;&#x6CC9;&#x6C34;&#x74F6;&#x76D6;&#x4E0A;&#x94BB;&#x4E24;&#x4E2A;&#x6D1E;&#xFF0C;&#x4E00;&#x4E2A;&#x548C;&#x6CE8;&#x6CB9;&#x7BA1;&#x7C97;&#x7EC6;&#x4E00;&#x81F4;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x5C0F;&#x4E00;&#x70B9;&#x7528;&#x4E8E;&#x6392;&#x6C14;&#x3002;
&#x4E3A;&#x907F;&#x514D;&#x5239;&#x8F66;&#x6CB9;&#x5F04;&#x810F;&#x6765;&#x4EE4;&#x7247;&#x548C;&#x789F;&#x5239;&#x7247;&#xFF0C;&#x6362;&#x6CB9;&#x524D;&#x8D81;&#x7740;&#x4F60;&#x7684;&#x722A;&#x8FD8;&#x5E72;&#x51C0;&#xFF0C;&#x628A;&#x6765;&#x4EE4;&#x7247;&#x548C;&#x8F6E;&#x5B50;&#x5168;&#x90FD;&#x5378;&#x4E0B;&#x6765;&#xFF0C;&#x5E76;&#x5F80;&#x5239;&#x8F66;&#x5939;&#x5668;&#x5185;&#x88C5;&#x5165;&#x57AB;&#x7247;&#x3002;
&#x63A5;&#x4E0B;&#x6765;
&#x628A;&#x5239;&#x628A;&#x4F4D;&#x7F6E;&#x8C03;&#x6574;&#x4E3A;&#x6C34;&#x5E73;&#xFF0C;&#x7136;&#x540E;&#x7528;2mm&#x6273;&#x624B;&#x5C06;&#x5239;&#x628A;&#x7684;&#x8C03;&#x8282;&#x5239;&#x8F66;&#x677E;&#x7D27;&#x5EA6;&#x7684;&#x87BA;&#x4E1D;&#x8C03;&#x8282;&#x5230;&#x6700;&#x677E;&#x3002;
&#x51C6;&#x5907;&#x624B;&#x5957;&#xFF0C;&#x6E05;&#x6D01;&#x7528;&#x54C1;&#x7559;&#x5230;&#x6362;&#x6CB9;&#x540E;&#x4F7F;&#x7528;&#xFF0C;&#x8FD8;&#x6709;&#x7EB8;&#x5DFE;&#xFF5E;</p>
<h1 id="&#x6362;&#x6CB9;&#xFF1A;"><a class="headerlink" href="/#%E6%8D%A2%E6%B2%B9%EF%BC%9A" title="&#x6362;&#x6CB9;&#xFF1A;"></a>&#x6362;&#x6CB9;&#xFF1A;</h1>
<p>&#x5C06;&#x51C6;&#x5907;&#x597D;&#x7684;&#x77FF;&#x6CC9;&#x6C34;&#x74F6;&#x63A5;&#x5230;&#x5239;&#x8F66;&#x5939;&#x5668;&#x7684;&#x6CE8;&#x6CB9;&#x5B54;&#xFF0C;&#x7528;&#x6273;&#x624B;&#x62E7;&#x677E;&#x6CE8;&#x6CB9;&#x5B54;&#x87BA;&#x4E1D;1/4&#x5708;&#x5DE6;&#x53F3;&#xFF08;&#x4E0D;&#x8981;&#x5168;&#x90E8;&#x62E7;&#x4E0B;&#x6765;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5239;&#x628A;&#x7684;&#x6362;&#x6CB9;&#x87BA;&#x4E1D;&#x62E7;&#x4E0B;&#x6765;&#x4FDD;&#x5B58;&#x597D;&#xFF0C;&#x6CB9;&#x4F1A;&#x987A;&#x7740;&#x91CD;&#x529B;&#x6D41;&#x5165;&#x77FF;&#x6CC9;&#x6C34;&#x74F6;&#x4E2D;&#xFF0C;&#x8BE5;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x8F7B;&#x634F;&#x5239;&#x628A;&#x8BA9;&#x6CB9;&#x6392;&#x5F97;&#x66F4;&#x5F7B;&#x5E95;&#x4E00;&#x70B9;&#x3002;</p>
<p>&#x6CB9;&#x5168;&#x90E8;&#x6392;&#x5C3D;&#x540E;&#x5173;&#x95ED;&#x5239;&#x8F66;&#x5939;&#x5668;&#x7684;&#x6CB9;&#x5B54;&#xFF0C;&#x53D6;&#x4E0B;&#x77FF;&#x6CC9;&#x6C34;&#x74F6;&#xFF0C;&#x5C06;&#x6F0F;&#x6597;&#x62E7;&#x5230;&#x5239;&#x628A;&#x4E0A;&#x9762;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x62E7;&#x5F88;&#x7D27;&#x6B64;&#x5904;&#x4E0D;&#x9700;&#x8981;&#x5F88;&#x9AD8;&#x7684;&#x5BC6;&#x5C01;&#x3002;&#x5C06;&#x6CE8;&#x5C04;&#x5668;&#x5185;&#x62BD;&#x5165;20ml&#x5DE6;&#x53F3;&#x7684;&#x5239;&#x8F66;&#x6CB9;&#xFF0C;&#x8FDE;&#x63A5;&#x5230;&#x5939;&#x5668;&#x7684;&#x6CE8;&#x6CB9;&#x5B54;&#x4E2D;&#x3002;&#x6B64;&#x5904;&#x5EFA;&#x8BAE;&#x4E24;&#x4EBA;&#x5408;&#x4F5C;&#x3002;&#x6253;&#x5F00;&#x5939;&#x5668;&#x7684;&#x6362;&#x6CB9;&#x87BA;&#x4E1D;&#xFF0C;&#x5C06;&#x5239;&#x8F66;&#x6CB9;&#x7F13;&#x6162;&#x7684;&#x63A8;&#x5165;&#x5239;&#x8F66;&#x5185;&#xFF08;&#x4E0D;&#x5FC5;&#x62C5;&#x5FC3;&#x6709;&#x6C14;&#x6CE1;&#x8FDB;&#x5165;&#xFF0C;&#x56E0;&#x4E3A;&#x8FC7;&#x540E;&#x4F1A;&#x6392;&#x6C14;&#xFF09;&#x3002;&#x7B49;&#x6F0F;&#x6597;&#x5185;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x6CB9;&#x540E;&#x505C;&#x6B62;&#x6CE8;&#x6CB9;&#xFF08;&#x6F0F;&#x6597;&#x5185;&#x9700;&#x8981;&#x7559;&#x4E00;&#x4E9B;&#x6CB9;&#x7684;&#xFF0C;&#x591A;&#x4E00;&#x70B9;&#x6700;&#x597D;&#xFF09;&#x3002;&#x5173;&#x95ED;&#x5939;&#x5668;&#x7684;&#x6362;&#x6CB9;&#x5B54;&#xFF0C;&#x53D6;&#x53E6;&#x4E00;&#x4E2A;&#x5E72;&#x51C0;&#x7684;&#x77FF;&#x6CC9;&#x6C34;&#x74F6;&#xFF0C;&#x63A5;&#x5230;&#x5939;&#x5668;&#x7684;&#x6CB9;&#x5B54;&#x4E0A;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x9700;&#x8981;&#x6392;&#x6C14;&#xFF0C;&#x53D6;&#x65B0;&#x77FF;&#x6CC9;&#x6C34;&#x74F6;&#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x6392;&#x51FA;&#x6765;&#x7684;&#x6CB9;&#x53EF;&#x4EE5;&#x56DE;&#x6536;&#x518D;&#x5229;&#x7528;&#xFF0C;&#x800C;&#x4E14;&#x6CB9;&#x4E0D;&#x8981;&#x5F04;&#x5230;&#x76AE;&#x80A4;&#x4E0A;&#xFF0C;&#x5BF9;&#x76AE;&#x80A4;&#x4E0D;&#x597D;&#x3002;
&#x5148;&#x677E;&#x5F00;&#x5939;&#x5668;&#x7684;&#x6362;&#x6CB9;&#x87BA;&#x4E1D;&#xFF0C;&#x8BA9;&#x6CB9;&#x6D41;&#x51FA;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x6B64;&#x65F6;&#x4E0D;&#x4F46;&#x8981;&#x6CE8;&#x610F;&#x6D41;&#x51FA;&#x6765;&#x7684;&#x6CB9;&#x8FD8;&#x6709;&#x6CA1;&#x6709;&#x6C14;&#x6CE1;&#x800C;&#x4E14;&#x8981;&#x6CE8;&#x610F;&#x6F0F;&#x6597;&#x5185;&#x7684;&#x6CB9;&#x662F;&#x5426;&#x6392;&#x51C0;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x4FDD;&#x6301;&#x6F0F;&#x6597;&#x5185;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x5239;&#x8F66;&#x6CB9;&#x3002;&#x7B49;&#x6CA1;&#x6709;&#x6C14;&#x6CE1;&#x6392;&#x51FA;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x5173;&#x95ED;&#x4E86;&#x3002;
&#x63E1;&#x7D27;&#x5239;&#x628A;&#xFF0C;&#x5FEB;&#x901F;&#x7684;&#x6253;&#x5F00;&#x5939;&#x5668;&#x4E0A;&#x7684;&#x6362;&#x6CB9;&#x87BA;&#x4E1D;&#x653E;&#x6CB9;&#xFF08;0.5&#xFF5E;1&#x79D2;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x6162;&#x6162;&#x5730;&#x677E;&#x5F00;&#x5239;&#x628A;&#xFF0C;&#x53CD;&#x590D;&#x7684;&#x634F;&#x51E0;&#x6B21;&#x5239;&#x628A;&#xFF0C;&#x6CE8;&#x610F;&#x662F;&#x5426;&#x6709;&#x6C14;&#x6CE1;&#x6392;&#x51FA;&#x3002;&#x518D;&#x6301;&#x7EED;&#x91CD;&#x590D;&#x8BE5;&#x8FC7;&#x7A0B;&#x51E0;&#x6B21;&#xFF0C;&#x76F4;&#x5230;&#x611F;&#x89C9;&#x5239;&#x628A;&#x624B;&#x611F;&#x6062;&#x590D;&#x6B63;&#x5E38;&#x4E3A;&#x6B62;&#x3002;&#x6B64;&#x65F6;&#x82E5;&#x8FD8;&#x6709;&#x6C14;&#x6CE1;&#x5192;&#x51FA;&#xFF0C;&#x5219;&#x8FD8;&#x9700;&#x8981;&#x91CD;&#x590D;&#x4E0A;&#x8FF0;&#x8FC7;&#x7A0B;&#x51E0;&#x6B21;&#x3002;&#xFF08;&#x91CD;&#x590D;&#x634F;&#x5239;&#x628A;&#x653E;&#x6CB9;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x62CD;&#x6253;&#x6CB9;&#x7BA1;&#x8BA9;&#x6C14;&#x6CE1;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x5168;&#x90E8;&#x6392;&#x5230;&#x4E0A;&#x9762;)&#x3002;&#x7136;&#x540E;&#x5C06;&#x5239;&#x628A;&#x503E;&#x659C;30&#x5EA6;&#x89D2;&#xFF0C;&#x518D;&#x53CD;&#x590D;&#x6309;&#x538B;&#x51E0;&#x6B21;&#x5239;&#x628A;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x6392;&#x6E05;&#x5168;&#x90E8;&#x7684;&#x7A7A;&#x6C14;&#x3002;
&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x5C06;&#x76F4;&#x63A5;&#x51B3;&#x5B9A;&#x6362;&#x6CB9;&#x8D28;&#x91CF;&#x7684;&#x597D;&#x574F;&#x3002;&#x7B49;&#x9759;&#x7F6E;&#x5F88;&#x4E45;&#x540E;&#x6CA1;&#x6709;&#x6C14;&#x6CE1;&#x5192;&#x51FA;&#xFF0C;&#x5E76;&#x4E14;&#x5239;&#x8F66;&#x624B;&#x611F;&#x6062;&#x590D;&#x5F97;&#x5DEE;&#x4E0D;&#x591A;&#x5C31;&#x80FD;&#x8BF4;&#x660E;&#x6C14;&#x6CE1;&#x6392;&#x5F97;&#x5DEE;&#x4E0D;&#x591A;&#x4E86;&#x3002;</p>
<p>&#x62E7;&#x7D27;&#x5939;&#x5668;&#x7684;&#x6362;&#x6CB9;&#x87BA;&#x4E1D;&#xFF0C;&#x9632;&#x6B62;&#x6709;&#x6CB9;&#x4F1A;&#x518D;&#x6F0F;&#x51FA;&#x6765;&#x3002;&#x7528;&#x6362;&#x6CB9;&#x5DE5;&#x5177;&#x9644;&#x5E26;&#x7684;&#x585E;&#x5B50;&#x5C06;&#x6F0F;&#x6597;&#x5E95;&#x90E8;&#x5835;&#x4F4F;&#xFF0C;&#x9632;&#x6B62;&#x62C6;&#x6F0F;&#x6597;&#x65F6;&#x6CB9;&#x5168;&#x90E8;&#x90FD;&#x6F0F;&#x51FA;&#x6765;&#x6D6A;&#x8D39;&#x6389;&#x3002;&#x62C6;&#x9664;&#x8FDE;&#x63A5;&#x5728;&#x6362;&#x6CB9;&#x5B54;&#x7684;&#x5BFC;&#x7BA1;&#xFF0C;&#x5C06;&#x6CB9;&#x6E05;&#x6D01;&#x5E72;&#x51C0;&#x5E76;&#x5C06;&#x9632;&#x5C18;&#x585E;&#x585E;&#x56DE;&#x539F;&#x6765;&#x7684;&#x4F4D;&#x7F6E;&#x3002;
&#x62C6;&#x6389;&#x6F0F;&#x6597;&#xFF0C;&#x5C06;&#x591A;&#x4F59;&#x7684;&#x5239;&#x8F66;&#x6CB9;&#x56DE;&#x6536;&#x518D;&#x5229;&#x7528;&#xFF0C;&#x6EF4;&#x51E0;&#x6EF4;&#x5239;&#x8F66;&#x6CB9;&#x5230;&#x5239;&#x628A;&#x7684;&#x6CE8;&#x6CB9;&#x5B54;&#x8BA9;&#x91CC;&#x9762;&#x7684;&#x6DB2;&#x4F53;&#x6EA2;&#x51FA;&#x518D;&#x62E7;&#x7D27;&#x5239;&#x628A;&#x7684;&#x87BA;&#x4E1D;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x9632;&#x6B62;&#x62E7;&#x87BA;&#x4E1D;&#x65F6;&#x518D;&#x6DF7;&#x5165;&#x6C14;&#x6CE1;&#x4E86;&#x3002;</p>
<p>&#x786E;&#x4FDD;&#x9879;&#x64CD;&#x4F5C;&#x65E0;&#x8BEF;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x6536;&#x5DE5;&#x4E86;&#x3002;</p>
<p>&#x5239;&#x8F66;&#x6CB9;&#x6362;&#x597D;&#x540E;&#xFF0C;&#x5C0F;&#x5FC3;&#x7FFC;&#x7FFC;&#x5730;&#x628A;&#x6F0F;&#x6597;&#x91CC;&#x7684;&#x6CB9;&#x5012;&#x56DE;&#x6CB9;&#x74F6;&#x5185;&#x56DE;&#x6536;&#x5229;&#x7528;&#xFF0C;&#x539F;&#x5239;&#x8F66;&#x6392;&#x51FA;&#x7684;&#x5E9F;&#x5F03;&#x5239;&#x8F66;&#x6CB9;&#x662F;&#x4E0D;&#x80FD;&#x4E8C;&#x6B21;&#x5229;&#x7528;&#x7684;&#xFF0C;&#x786E;&#x4FDD;&#x4E0D;&#x6C61;&#x67D3;&#x73AF;&#x5883;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5904;&#x7406;&#x6389;&#x5373;&#x53EF;&#x3002;&#x7528;&#x6E05;&#x6D01;&#x5242;&#x64E6;&#x597D;&#x4F60;&#x7684;&#x7231;&#x8F66;&#x7136;&#x540E;&#x518D;&#x628A;&#x6765;&#x4EE4;&#x7247;&#x548C;&#x8F66;&#x8F6E;&#x88C5;&#x56DE;&#x53BB;&#x3002;&#x6CE8;&#x610F;&#x4E00;&#x5B9A;&#x4E0D;&#x8981;&#x8BA9;&#x789F;&#x7247;&#x548C;&#x6765;&#x4EE4;&#x7247;&#x6CBE;&#x6CB9;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5239;&#x8F66;&#x4E60;&#x60EF;&#x9002;&#x5F53;&#x8C03;&#x8282;&#x5239;&#x628A;&#x5185;&#x4FA7;&#x7684;&#x8C03;&#x8282;&#x5239;&#x8F66;&#x677E;&#x7D27;&#x7684;&#x87BA;&#x4E1D;&#xFF0C;&#x624B;&#x611F;&#x6700;&#x597D;&#x5373;&#x53EF;&#x3002;</p>
<blockquote>
<p>&#x672C;&#x7BC7;&#x6587;&#x7AE0;&#x4EC5;&#x6839;&#x636E;&#x4E2A;&#x4EBA;&#x7ECF;&#x9A8C;&#x5199;&#x51FA;&#xFF0C;&#x4E0D;&#x540C;&#x578B;&#x53F7;&#x7684;&#x5239;&#x8F66;&#x4F1A;&#x6709;&#x4E9B;&#x8BB8;&#x4E0D;&#x540C;&#xFF0C;&#x82E5;&#x6709;&#x9519;&#x8BEF;&#x8BF7;&#x5728;&#x8BC4;&#x8BBA;&#x533A;&#x6307;&#x51FA;&#xFF0C;&#x4EE5;&#x4FBF;&#x6211;&#x53CA;&#x65F6;&#x6539;&#x6B63;&#x3002;
&#x6362;&#x6CB9;&#x770B;&#x8D77;&#x6765;&#x597D;&#x50CF;&#x5F88;&#x96BE;&#x7684;&#x5B9E;&#x9645;&#x4E0A;&#x627E;&#x4E2A;&#x89C6;&#x9891;&#x770B;&#x770B;&#x518D;&#x52A8;&#x624B;&#x64CD;&#x4F5C;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x6211;&#x5199;&#x7684;&#x6559;&#x7A0B;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x6E05;&#x695A;&#x6240;&#x4EE5;&#x603B;&#x662F;&#x628A;&#x7B80;&#x5355;&#x7684;&#x95EE;&#x9898;&#x590D;&#x6742;&#x5316;&#x4E86;&#x3002;</p>
</blockquote>
<br>
<br>
<br>
# &#x5C71;&#x5730;&#x8F66;&#x5239;&#x8F66;&#x4E4B;&#x6362;&#x8840;&#x3002;
<br>
<br>

    </main>
    <footer class="post-footer">
      
      <div class="post-tags">
        <a class="post-tag button" href="/tags/%E7%90%90%E4%BA%8B/" rel="tag"><i class="fas fa-tag"></i>琐事</a><a class="post-tag button" href="/tags/%E5%B1%B1%E5%9C%B0%E8%BD%A6/" rel="tag"><i class="fas fa-tag"></i>山地车</a>
      </div>
      
    </footer>
  </article>
  
  <nav class="page-nav">
    <div class="page-nav-next page-nav-item">
      
      <a href="/Things.html" rel="next" title="整理文件 && 记录一下最近发生的事情"><i class="fas fa-angle-left"></i><span class="nav-title">整理文件 && 记录一下最近发生的事情</span></a>
      
    </div>
    <div class="page-nav-prev page-nav-item">
      
      <a href="/Hello-2017.html" rel="prev" title="Hello 2017!"><span class="nav-title">Hello 2017!</span><i class="fas fa-angle-right"></i></a>
      
    </div>
  </nav>
  
  
<div class="reward" id="reward">
  <p>自动售卖机卖的摩卡咖啡很好喝！！</p>
  <button id="reward-button" class="button" disable="enable"><i class="fas fa-donate"></i>Reward</button>
  <div id="qr" class="qr" style="display: none;" aria-hidden="true">
    
    <div id="wechat">
      <img id="wechat_qr" src="/images/wechat.jpg" alt="WechatPay"/>
      <span>WechatPay</span>
    </div>
    
    
    <div id="alipay">
      <img id="alipay_qr" src="/images/aliPay.jpg" alt="AliPay"/>
      <span>AliPay</span>
    </div>
    
    
  </div>
</div>


  
  
  
  

<div class="comments" id="comments">
  
  <div class="commentjs" id="comment-thread"></div>
  <link rel="stylesheet" href="/css/commentjs.css">
  <script defer type="text/javascript" src="/js/marked.min.js"></script>
  <script defer type="text/javascript" src="/js/timeago.min.js"></script>
  <script defer type="text/javascript" src="/js/highlight.min.js"></script>
  <script defer type="text/javascript" src="/js/commentjs.js"></script>
  <script type="text/javascript">
  $(document).ready(function () {
    getComments({
      "type": "github",
      "user": "HxSTARRY-S",
      "repo": "blog.starry-s.xyz",
      "clientID": "",
      "clientSecret": "",
      "no_comment": "This page has no comment, go to comment now!",
      "go_to_comment": "Go to Comment",
      "issue_title": "山地车刹车换血",
      "btn_class": "button",
      "comments_target": "#comment-thread"
    });
    marked.setOptions({
      "highlight": function (code, lang) {
        return hljs.highlightAuto(code).value;
      }
    });
    function mark() {
      var markdowns = document.getElementsByClassName("markdown");
      for (var i = 0; i < markdowns.length; ++i){
        if (markdowns[i].innerHTML) {
          markdowns[i].innerHTML = marked(markdowns[i].innerHTML);
        }
      }
    }
    window.addEventListener("DOMContentLoaded", mark, false);
    window.addEventListener("load", mark, false);
  });
  </script>
  
</div>



  
</div>

          </div>
          
          
          
<aside class="sidebar" id="sidebar" style="background: url(/images/background.png);">
  
  <div class="search">
    <div class="form-group">
      <i class="fas fa-search"></i><input type="search" id="search-input" name="q" results="0" placeholder="Search" class="form-control"/>
    </div>
  </div>
  <div class="search-result-box" id="search-result"></div>
  
  
<div class="info sidebar-item" id="info">
  
  <img class="author-avatar" src="/images/avatar.jpg" alt="STARRY-S">
  
  <h1 class="author-name">STARRY-S</h1>
  <h2 class="author-description">A blog of a common student.</h2>
  <div class="site-count">
    
    
    
    
    <div class="archives-count count-block">
      <div class="site-count-title">Archives</div>
      <div><a href="/archives/">19</a></div>
    </div>
    
    
    
    <div class="categories-count count-block">
      <div class="site-count-title">Categories</div>
      <div><a href="/categories/">18</a></div>
    </div>
    
    
    
    <div class="tags-count count-block">
      <div class="site-count-title">Tags</div>
      <div><a href="/tags/">22</a></div>
    </div>
    
    
    
    
  </div>
  
  <div class="rss">
    <a class="rss-link button sidebar-item" href="/atom.xml"><i class="fas fa-rss"></i>RSS</a>
  </div>
  
</div>


  <div class="sidebar-sticky">
    
    
    <hr>
    <div class="post-toc sidebar-item" id="toc-div">
      <div><i class="fas fa-list-ol"></i>Table of Contents</div>
      <div class="post-toc-content">
        
        
        <ol class="list-group toc">
        
          <li>
            <a class="list-group-item toc-link" href="#所需工具：">所需工具：</a>
            
          </li>
        
          <li>
            <a class="list-group-item toc-link" href="#准备工作：">准备工作：</a>
            
          </li>
        
          <li>
            <a class="list-group-item toc-link" href="#换油：">换油：</a>
            
          </li>
        
        </ol>
        
      </div>
    </div>
    
    
    
    <hr>
    <div class="social-link sidebar-item">
      <div><i class="far fa-address-card"></i>Social Links</p></div>
      <ul>
        
        <li><i class="fas fa-envelope"></i><a href="mailto:hxstarrys@163.com" target="_blank">E-Mail</a></li>
        
        <li><i class="fab fa-github"></i><a href="https://github.com/STARRY-S" target="_blank">GitHub</a></li>
        
        <li><i class="fab fa-weibo"></i><a href="https://space.bilibili.com/19189337/" target="_blank">Bilibili</a></li>
        
      </ul>
    </div>
    
    
    <hr>
    <div class="blogroll sidebar-item">
      <div><i class="fas fa-user-friends"></i>Blogroll</div>
      <ul>
        
        <li><i class="fas fa-link"></i><a href="https://alynx.xyz/" target="_blank">Alynx Zhou</a></li>
        
      </ul>
    </div>
    
  </div>
</aside>


          
        </div>
      </div>
    </main>
    
<footer id="footer" class="footer" style="background: #19323c;">
  <div class="container">
    <div class="back-to-top">
      <button id="back-to-top"><i class="fas fa-angle-double-up" aria-label="Back to Top"></i></button>
    </div>
    <div class="footer-container">
      <div class="footer-left">
        <div class="copyright">
          <span class="author"><i class="far fa-edit"></i>STARRY-S</span><span class="years"><i class="far fa-copyright"></i><span id="years-text">2016.8</span></span><span class="creative-commons"><i class="fab fa-creative-commons"></i><a href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">BY-NC-SA 4.0</a></span>
        </div>
        
        <div class="busuanzi">
          <span id="busuanzi_container_site_pv"><i class="fas fa-eye" aria-label="Site Visit Count" aria-hidden="false"></i><span id="busuanzi_value_site_pv"></span></span><span id="busuanzi_container_site_uv"><i class="fas fa-user" aria-label="Site User Count" aria-hidden="false"></i><span id="busuanzi_value_site_uv"></span></span><span id="busuanzi_container_page_pv"><i class="fas fa-file-alt"></i><span id="busuanzi_value_page_pv" aria-label="Page Click Count" aria-hidden="false"></span></span>
        </div>
        
      </div>
      <div class="footer-right">
        <div class="custom-info">
          
          托管于<i class="fab fa-github-alt"></i><a href="https://pages.github.com/" target="_blank">GitHub Pages</a>
          
        </div>
        <div class="powered-by">
          Proudly Powered by <a href="https://github.com/AlynxZhou/hikaru/" target="_blank">Hikaru</a><i class="fab fa-node-js"></i>Theme is <a href="https://github.com/AlynxZhou/hikaru-theme-aria/" target="_blank">ARIA</a>
        </div>
      </div>
    </div>
  </div>
</footer>


  </body>
</html>
