<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
    <meta name="theme-color" content="#1c0b2b">
    <meta name="msapplication-TileColor" content="#1c0b2b">
    
    
    
    <meta name="keywords" content="Life, ARIA, Hikaru, STARRY-S">
    
    
    <link rel="apple-touch-icon" sizes="180x180" href="/favicons/apple-touch-icon.png">
    
    
    <link rel="icon" type="image/png" sizes="192x192" href="/favicons/android-chrome-192x192.png">
    
    
    <link rel="icon" type="image/png" sizes="32x32" href="/favicons/favicon-32x32.png">
    
    
    <link rel="icon" type="image/png" sizes="16x16" href="/favicons/favicon-16x16.png">
    
    
    <link rel="mask-icon" href="/favicons/safari-pinned-tab.svg" color="#1c0b2b">
    
    
    <link rel="manifest" href="/favicons/site.webmanifest">
    
    
    <meta name="msapplication-config" content="/favicons/browserconfig.xml">
    
    
    <link rel="shortcut icon" type="image/x-icon" href="/favicons/favicon.ico">
    
    
    <link rel="alternate" href="/atom.xml" title="STARRY-S' Blog" type="application/atom+xml" />
    
    
    <link rel="stylesheet" type="text/css" href="/css/normalize.css">
    <link rel="stylesheet" type="text/css" href="/css/index.css">
    
    <link rel="stylesheet" type="text/css" href="/css/sidebar.css">
    
    
<link rel="stylesheet" type="text/css" href="/css/page.css">
<link rel="stylesheet" type="text/css" href="/css/post.css">

    <link rel="stylesheet" type="text/css" href="/css/custom.css">
    <link rel="stylesheet" type="text/css" href="/css/atom-one-dark.css">
    <link rel="stylesheet" type="text/css" href="/css/lightgallery.min.css">
    <script type="text/javascript" src="/js/jquery.min.js"></script>
    <script defer type="text/javascript" src="/js/util.js"></script>
    <script defer type="text/javascript" src="/js/scrollspy.js"></script>
    <script defer type="text/javascript" src="/js/fontawesome-all.min.js"></script>
    <script defer type="text/javascript" src="/js/lightgallery.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-fullscreen.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-hash.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-pager.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-thumbnail.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-zoom.min.js"></script>
    
    <script defer src="/js/busuanzi.pure.mini.js"></script>
    
    
    <script defer type="text/javascript" src="/js/search.js"></script>
    <script type="text/javascript">
    $(document).ready(function () {
      var searchPath = "/search.json";
      if ("search.json".length === 0) {
        searchPath = "/search.json";
      }
      searchFunc(searchPath, "search-input", "search-result");
    });
    </script>
    
    
    <script defer type="text/javascript" src="/js/index.js"></script>
    
    <script defer type="text/javascript" src="/js/custom.js"></script>
    <title>一个人的旅行 —— 上海 | STARRY-S' Blog - I never quite realized...</title>
  </head>
  <body itemscope itemtype="http://schema.org/WebPage" lang="en"  data-spy="scroll" data-target=".list-group">
    
<header id="header" class="header" style="background: #1c0b2b;">
  <div class="container">
    <div class="header-container">
      <div class="header-title">
        <h1 class="title"><a href="/">STARRY-S' Blog</a></h1>
        <h2 class="subtitle">I never quite realized...</h2>
      </div>
      
      <div class="logo">
        <img src="/images/logo.png" alt="logo">
      </div>
      
    </div>
    <nav id="nav" class="nav">
      <a id="nav-toggle" class="nav-toggle" aria-hidden="true"><i class="fas fa-bars" aria-label="Toggle Navbar"></i></a>
      <ul id="menu" role="menubar" aria-hidden="false">
        
        <li role="menuitem"><a href="/"><i class="fas fa-home"></i><span class="menu-text">Home</span></a></li>
        
        <li role="menuitem"><a href="/archives/"><i class="fas fa-archive"></i><span class="menu-text">Archives</span></a></li>
        
        <li role="menuitem"><a href="/categories/"><i class="fas fa-th-list"></i><span class="menu-text">Categories</span></a></li>
        
        <li role="menuitem"><a href="/tags/"><i class="fas fa-tags"></i><span class="menu-text">Tags</span></a></li>
        
        <li role="menuitem"><a href="/about/"><i class="fas fa-user-edit"></i><span class="menu-text">About</span></a></li>
        
      </ul>
    </nav>
    <!-- Global site tag (gtag.js) - Google Analytics -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-124615792-1"></script>
    <script>
      window.dataLayer = window.dataLayer || [];
      function gtag(){dataLayer.push(arguments);}
      gtag('js', new Date());

      gtag('config', 'UA-124615792-1');
    </script>

  </div>
</header>


    <main id="main" class="main">
      <div class="container">
        <div class="main-container">
          <div class="content">
            
<div id="post" class="page">
  <article class="article post card" itemscope itemtype="http://schema.org/Article">
    <div class="post-block">
      <link itemprop="mainEntityOfPage" href="https://blog.starry-s.xyz/posts/Shanghai/">
      <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
        <meta itemprop="name" content="STARRY-S">
        <meta itemprop="description" content="How beautiful this world is.">
        <meta itemprop="image" content="/images/avatar.jpg">
      </span>
      <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
        <meta itemprop="name" content="STARRY-S' Blog">
      </span>
    </div>
    <header class="post-header">
      <h1 class="post-title" itemprop="name headline">一个人的旅行 —— 上海</h1>
      <div class="post-meta">
        
        <span class="post-date meta-block">
          <i class="far fa-calendar-plus"></i><span><time title="post-date" itemprop="dateCreated datePublished" datetime="2019-04-09T05:24:44.000Z">2019-04-09 Tue 13:24:44 CST</time></span>
        </span>
        
        
        <span class="post-categories meta-block">
          
          <i class="far fa-folder-open"></i><span itemprop="about" itemscope itemtype="http://schema.org/Thing"><a href="/categories/%E7%90%90%E4%BA%8B/" itemprop="url" rel="index"><span itemprop="name">琐事</span></a></span><i class="fas fa-angle-right"></i><span itemprop="about" itemscope itemtype="http://schema.org/Thing"><a href="/categories/%E7%90%90%E4%BA%8B/Trip/" itemprop="url" rel="index"><span itemprop="name">Trip</span></a></span>
        </span>
        
        
        
        
      </div>
    </header>
    <main class="post-main" itemprop="articleBody">
      <p><img src="/posts/Shanghai/images/shanghai.jpg" alt></p>
<div class="alert-red">&#x591A;&#x56FE;&#xFF0C;&#x9996;&#x6B21;&#x52A0;&#x8F7D;&#x5927;&#x7EA6;&#x6D88;&#x8017;2.2MB</div>

<p>&#x7B2C;&#x4E00;&#x6B21;&#x4E00;&#x4E2A;&#x4EBA;&#x8DD1;&#x90A3;&#x4E48;&#x8FDC;&#x6E9C;&#x8FBE;&#xFF0C;&#x5F88;&#x6709;&#x610F;&#x601D;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#x3002;</p>
<a id="more"></a>

<p>&#x4E0D;&#x8981;&#x95EE;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x8FC7;&#x4E86;&#x8FD9;&#x4E48;&#x4E45;&#x624D;&#x628A;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7801;&#x51FA;&#x6765;&#x2026;</p>
<hr>
<p><img src="/posts/Shanghai/images/IMG_4138-1.jpg" alt></p>
<iframe frameborder="no" border="0" marginwidth="0" marginheight="0" width="530" height="86" src="//music.163.com/outchain/player?type=2&amp;id=1313107868&amp;auto=1&amp;height=66"></iframe>

<p>&#x56E0;&#x4E3A;&#x7248;&#x6743;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x5728;&#x8FD9;&#x91CC;&#x653E;&#x4E0A;live&#x7248;&#x7684;BGM&#x5427;&#xFF0C;&#x5F88;&#x597D;&#x542C;&#x3002;</p>
<p>&#x5F88;&#x4E45;&#x4EE5;&#x524D;&#x5C31;&#x6709;&#x60F3;&#x53BB;&#x4E0A;&#x6D77;&#x7684;&#x5FF5;&#x5934;&#x4E86;&#x3002;</p>
<p>&#x6700;&#x5F00;&#x59CB;&#x662F;&#x6253;&#x7B97;&#x5728;&#x4E0B;&#x4E00;&#x6B21;BW&#x4E3E;&#x529E;&#x7684;&#x65F6;&#x5019;&#x53BB;&#x4E0A;&#x6D77;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x60F3;&#x4E86;&#x60F3;&#x8981;&#x662F;&#x4E00;&#x6574;&#x4E2A;&#x5BD2;&#x5047;&#x54EA;&#x91CC;&#x90FD;&#x6CA1;&#x53BB;&#x5B9E;&#x5728;&#x662F;&#x4E0D;&#x7518;&#x5FC3;&#xFF0C;&#x9042;&#x5B9A;&#x673A;&#x7968;&#x7B80;&#x5355;&#x7684;&#x5236;&#x5B9A;&#x4E86;&#x8BA1;&#x5212;&#x548C;&#x9884;&#x7B97;&#xFF0C;&#x5F00;&#x59CB;&#x4E86;&#x8FD9;&#x8D9F;&#x65C5;&#x884C;&#x3002;</p>
<p>&#x51C6;&#x786E;&#x70B9;&#x8BF4;&#x4E0D;&#x5168;&#x662F;&#x6211;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x65C5;&#x884C;&#xFF0C;&#x53EA;&#x6709;&#x53BB;&#x9664;&#x6389;&#x548C;&#x670B;&#x53CB;&#x4E00;&#x540C;&#x5750;&#x4E86;&#x4E00;&#x8D9F;&#x98DE;&#x673A;&#x548C;&#x78C1;&#x60AC;&#x6D6E;&#xFF08;&#x706B;&#x8F66;&#x5C31;&#x4E0D;&#x7B97;&#x4E86;&#xFF09;&#x540E;&#x5C31;&#x5269;&#x4E0B;&#x7684;&#x5C31;&#x662F;&#x4E00;&#x4EBA;&#x7684;&#x65C5;&#x884C;&#x4E86;&#x3002;</p>
<p>&#x4E0A;&#x98DE;&#x673A;&#x524D;&#x7684;&#x665A;&#x4E0A;&#xFF0C;&#x6211;&#x786C;&#x662F;&#x6CA1;&#x4E70;&#x5367;&#x94FA;&#x7968;&#x5728;&#x706B;&#x8F66;&#x7684;&#x786C;&#x5EA7;&#x4E0A;&#x5750;&#x7740;&#x71AC;&#x4E86;&#x4E00;&#x665A;&#x4E0A;&#x2026;&#x5168;&#x9760;&#x770B;Fate Zero&#x71AC;&#x8FC7;&#x6765;&#x7684;&#x2026;</p>
<p>&#x4E4B;&#x6240;&#x4EE5;&#x6765;&#x4E0A;&#x6D77;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x5F88;&#x60F3;&#x770B;&#x4E00;&#x4E0B;&#x8FD9;&#x4E48;&#x4E00;&#x5EA7;&#x62E5;&#x6709;B&#x7AD9;&#x603B;&#x90E8;&#x548C;&#x5DE8;&#x591A;B&#x7AD9;&#x5927;&#x4F6C;&#x7684;&#x57CE;&#x5E02;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x7684;&#xFF0C;&#x67D0;&#x4E9B;&#x4E1C;&#x897F;&#x53EF;&#x80FD;&#x5728;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x773C;&#x91CC;&#x5F88;&#x5E73;&#x6DE1;&#x666E;&#x901A;&#x5427;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x89C9;&#x5F97;&#x5F88;&#x597D;&#x73A9;&#x3002;&#x6240;&#x4EE5;&#x53BB;&#x8FEA;&#x58EB;&#x5C3C;&#x73A9;&#x3001;&#x767B;&#x4E0A;&#x6D77;&#x4E4B;&#x5DC5;&#x3001;&#x5230;&#x91CE;&#x751F;&#x52A8;&#x7269;&#x56ED;&#x8FD1;&#x8DDD;&#x79BB;&#x770B;&#x5927;&#x8001;&#x864E;&#xFF08;f&#x1D4;&#xFF09;&#x5403;&#x8089;&#x8FD9;&#x4E9B;&#x53EA;&#x80FD;&#x88AB;&#x6211;&#x79F0;&#x4F5C;&#x662F;&#x672C;&#x6B21;&#x65C5;&#x884C;&#x7684;&#x9644;&#x8D60;&#x54C1;&#xFF0C;&#x6211;&#x5F53;&#x7136;&#x4E0D;&#x662F;&#x53EA;&#x5954;&#x7740;&#x8FD9;&#x4E9B;&#x53BB;&#x4E0A;&#x6D77;&#x7684;&#xFF0C;&#x4F46;&#x522B;&#x4EBA;&#x95EE;&#x4F60;&#x4F60;&#x82B1;&#x4E86;&#x90A3;&#x4E48;&#x591A;&#x94B1;&#x51FA;&#x53BB;&#x65C5;&#x6E38;&#x4E86;&#x4E00;&#x8D9F;&#x4EC0;&#x4E48;&#x4E5F;&#x6CA1;&#x73A9;&#x7684;&#x8BDD;&#x80AF;&#x5B9A;&#x4F1A;&#x9A82;&#x6211;&#x7684;&#x5BF9;&#x5427;&#x3002;&#x6BD5;&#x7ADF;&#x95E8;&#x7968;&#x4E0D;&#x8D35;&#x4E70;&#x4E86;&#x4E5F;&#x4E0D;&#x5403;&#x4E8F;&#x3002;</p>
<hr>
<p><img src="/posts/Shanghai/images/IMG_3617-1.jpg" alt="&#x9F99;&#x9633;&#x8DEF;"></p>
<iframe frameborder="no" border="0" marginwidth="0" marginheight="0" width="330" height="86" src="//music.163.com/outchain/player?type=2&amp;id=409931671&amp;auto=0&amp;height=66"></iframe>

<p>&#x6CA1;&#x6025;&#x7740;&#x7528;Metro&#x5927;&#x90FD;&#x4F1A;&#x624B;&#x673A;&#x5237;&#x7801;&#x6376;&#xFF08;&#x96FE;&#xFF09;&#x5730;&#x94C1;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x66F4;&#x60F3;&#x8BD5;&#x4E00;&#x4E0B;Apple Pay&#x662F;&#x600E;&#x4E48;&#x64CD;&#x4F5C;&#x7684;&#xFF08;&#x6240;&#x4EE5;&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x6CA1;&#x6709;&#x529E;&#x4E3A;&#x6E38;&#x5BA2;&#x51C6;&#x5907;&#x7684;&#x5730;&#x94C1;&#x5361;&#x7684;&#x539F;&#x56E0;&#xFF09;&#xFF0C;&#x73B0;&#x5728;&#x89C9;&#x5F97;&#x6211;&#x82B1;&#x4E86;60&#x5757;&#x94B1;&#x5145;Apple Pay&#x771F;&#x7684;&#x662F;&#x4EA4;&#x667A;&#x5546;&#x7A0E;&#xFF0C;&#x65E0;&#x6570;&#x6B21;&#x7684;&#x88AB;&#x5361;&#x5728;&#x70B8;&#x9E21;&#x53E3;&#x51FA;&#x4E0D;&#x53BB;&#x6709;&#x4E00;&#x6B21;&#x624B;&#x673A;&#x51FA;bug&#x53CC;&#x51FB;&#x7535;&#x6E90;&#x952E;&#x5F39;&#x4E0D;&#x51FA;&#x94B1;&#x5305;&#x754C;&#x9762;&#x540E;&#x9762;&#x6392;&#x4E86;&#x5F88;&#x957F;&#x7684;&#x961F;&#x4F0D;&#x662F;&#x600E;&#x6837;&#x7684;&#x611F;&#x53D7;&#x53EF;&#x60F3;&#x800C;&#x77E5;&#x3002;</p>
<p>&#x5728;&#x6B64;&#x4E4B;&#x524D;&#x53EA;&#x5750;&#x8FC7;&#x5317;&#x4EAC;&#x5730;&#x94C1;&#x548C;&#x6C88;&#x9633;&#x5730;&#x94C1;&#xFF0C;&#x5728;&#x5730;&#x94C1;&#x4E0A;&#x7AD9;&#x4E24;&#x4E2A;&#x5C0F;&#x65F6;&#x662F;&#x4EC0;&#x4E48;&#x611F;&#x53D7;&#x53EA;&#x5728;&#x4E0A;&#x6D77;&#x4F53;&#x9A8C;&#x8FC7;&#x2026;</p>
<p>&#x5899;&#x88C2;&#x63A8;&#x8350;&#x770B;&#x4E00;&#x4E0B;<a href="https://www.bilibili.com/video/av2625588" target="_blank">&#x4E0A;&#x6D77;&#x8F68;&#x4EA4;&#x7684;&#x9B3C;&#x755C;&#xFF08;&#x96FE;&#xFF09;</a>&#xFF0C;&#x4E0D;&#x7136;&#x7B2C;&#x4E00;&#x6B21;&#x5750;&#x5730;&#x94C1;&#x5F88;&#x5BB9;&#x6613;&#x8FF7;&#x8DEF;&#x7684;&#xFF08;&#x8C1C;&#x4E00;&#x6837;&#x7684;&#x903B;&#x8F91;&#xFF09;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x6B21;&#x81EA;&#x5DF1;&#x5916;&#x51FA;&#xFF0C;&#x6216;&#x591A;&#x6216;&#x5C11;&#x4F1A;&#x6709;&#x5931;&#x8BEF;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x9664;&#x4E86;&#x50CF;&#x7B97;&#x9519;&#x706B;&#x8F66;&#x7968;&#x65F6;&#x95F4;&#x9000;&#x7968;&#x6539;&#x7968;&#x591A;&#x82B1;&#x70B9;&#x624B;&#x7EED;&#x8D39;&#x4E4B;&#x5916;&#xFF0C;&#x65C5;&#x5E97;&#x9009;&#x5728;&#x4E86;&#x5609;&#x5B9A;&#x533A;&#x7740;&#x5B9E;&#x9EBB;&#x70E6;&#x4E86;&#x8BB8;&#x591A;&#x2026;</p>
<p>&#x56E0;&#x4E3A;&#x5F53;&#x65F6;&#x6211;&#x53EA;&#x77E5;&#x9053;&#x5E02;&#x533A;&#x7684;&#x65C5;&#x5E97;&#x8D35;&#xFF0C;&#x53C8;&#x4E0D;&#x60F3;&#x4F4F;&#x9752;&#x5E74;&#x65C5;&#x820D;&#xFF0C;&#x5C31;&#x9009;&#x4E2A;&#x4E0D;&#x5728;&#x5E02;&#x4E2D;&#x5FC3;&#x4F46;&#x662F;&#x79BB;&#x5730;&#x94C1;&#x7AD9;&#x4E0D;&#x592A;&#x8FDC;&#x7684;&#x5730;&#x65B9;&#xFF08;&#x4E8B;&#x5B9E;&#x4E0A;&#x9700;&#x8981;&#x8D70;&#x4E09;&#x5341;&#x5206;&#x949F;&#xFF09;&#x2026;</p>
<p>&#x5230;&#x540E;&#x6765;&#x624D;&#x77E5;&#x9053;&#x6211;&#x4F4F;&#x7684;&#x5730;&#x65B9;&#x79BB;&#x6C5F;&#x82CF;&#x597D;&#x8FD1;&#x554A;&#xFF0C;&#x8981;&#x662F;&#x5750;11&#x53F7;&#x7EBF;&#x652F;&#x7EBF;&#x5C31;&#x6C5F;&#x82CF;&#x82B1;&#x6865;&#x4E86;&#xFF0C;&#x7B80;&#x76F4;&#x2026;</p>
<p><img src="/posts/Shanghai/images/IMG_3259-1.jpg" alt="&#x732B;&#xFF01;&#x732B;&#xFF01;&#x732B;&#xFF01;&#x5FEB;&#x770B;&#xFF01;&#xFF01;&#xFF01;"></p>
<p>&#x4E0D;&#x8FC7;&#x65C5;&#x5E97;&#x7684;&#x7A97;&#x5B50;&#x5BF9;&#x9762;&#x6709;&#x732B;&#xFF01;&#xFF01;&#xFF01;&#x6BCF;&#x5929;&#x65E9;&#x6668;&#x62C9;&#x5F00;&#x7A97;&#x5E18;&#x770B;&#x5230;&#x5BF9;&#x9762;&#x623F;&#x9876;&#x6709;&#x732B;&#x5728;&#x6652;&#x592A;&#x9633;&#x7684;&#x611F;&#x89C9;&#x771F;&#x7684;&#x5F00;&#x5FC3;&#x6B7B;&#x4E86;&#xFF01;</p>
<hr>
<p><img src="/posts/Shanghai/images/IMG_3266-1.jpg" alt="11&#x53F7;&#x7EBF;&#x5609;&#x5B9A;&#x897F;&#x7AD9;"></p>
<hr>
<p><img src="/posts/Shanghai/images/5.jpg" alt></p>
<iframe frameborder="no" border="0" marginwidth="0" marginheight="0" width="430" height="86" src="//music.163.com/outchain/player?type=2&amp;id=468490569&amp;auto=0&amp;height=66"></iframe>

<p>&#x6240;&#x4EE5;&#x6700;&#x6F2B;&#x957F;&#x7684;&#x5C31;&#x662F;&#x5750;11&#x53F7;&#x7EBF;&#x82B1;&#x4E86;&#x5F88;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x624D;&#x80FD;&#x4ECE;&#x4E0A;&#x6D77;&#x7684;&#x5609;&#x5B9A;&#x5230;&#x4E0A;&#x6D77;&#x6D66;&#x4E1C;&#x7684;&#x8FEA;&#x58EB;&#x5C3C;&#x2026;</p>
<p><del>&#x4E00;&#x5F00;&#x59CB;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x5927;&#x54E5;&#x4E3A;&#x88AB;&#x5C0F;&#x59D0;&#x59D0;&#x53EB;&#x6210;&#x53D4;&#x53D4;&#x800C;&#x6293;&#x72C2;&#x7684;&#x65F6;&#x5019;&#x6211;&#x5185;&#x5FC3;&#x8FD8;&#x5728;&#x5077;&#x7B11;&#xFF0C;&#x76F4;&#x5230;&#x540E;&#x6765;&#x6211;&#x88AB;&#x4E00;&#x4E2A;&#x5B69;&#x5B50;&#x7684;&#x5988;&#x5988;&#x53EB;&#x53D4;&#x53D4;&#x2026;</del></p>
<p>&#x6240;&#x4EE5;&#x6211;&#x624D;&#x5F00;&#x59CB;&#x610F;&#x8BC6;&#x5230;&#x539F;&#x6765;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x5916;&#x8868;&#x4E5F;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x4EBA;&#x53BB;&#x8FEA;&#x58EB;&#x5C3C;&#x7684;&#x597D;&#x5904;&#x5C31;&#x662F;&#x6392;&#x961F;&#x6392;&#x5230;&#x6700;&#x540E;&#x9047;&#x5230;&#x9700;&#x8981;&#x4E00;&#x4EBA;&#x51D1;&#x6570;&#x7684;&#x65F6;&#x5019;&#x6211;&#x5C31;&#x80FD;&#x5408;&#x6CD5;&#x63D2;&#x961F;&#x4E86;&#x554A;&#x597D;&#x9AD8;&#x5174;&#x554A;&#x5F53;&#x65F6;&#xFF08;&#x540E;&#x6765;&#x6211;&#x624D;&#x77E5;&#x9053;&#x6709;&#x4E9B;&#x5730;&#x65B9;&#x6211;&#x4E00;&#x4E2A;&#x4EBA;&#x662F;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8D70;&#x5355;&#x4EBA;&#x901A;&#x9053;&#x6839;&#x672C;&#x4E0D;&#x7528;&#x6392;&#x961F;&#x2026;&#xFF09;</p>
<p><img src="/posts/Shanghai/images/IMG_3382-1.jpg" alt></p>
<p>&#x548C;&#x4E00;&#x4E2A;&#x5C0F;&#x59D0;&#x59D0;&#x4E00;&#x8D77;&#x5750;&#x7684;&#x521B;&#x6781;&#x901F;&#x5149;&#x8F6E;&#xFF0C;&#x5C0F;&#x59D0;&#x59D0;&#x88AB;&#x5413;&#x591F;&#x545B;&#xFF0C;&#x6211;&#x5168;&#x7A0B;&#x6CA1;&#x6562;&#x7741;&#x773C;&#x775B;&#x6B7B;&#x6B7B;&#x6293;&#x4F4F;&#x628A;&#x624B;&#x732B;&#x5728;&#x6700;&#x540E;&#x4E00;&#x6392;&#x2026;</p>
<p>&#x5728;B&#x7AD9;&#x4E0A;&#x770B;&#x5230;&#x6709;&#x4EBA;&#x7528;MC&#x8FD8;&#x539F;&#x4E86;&#x8FEA;&#x58EB;&#x5C3C;&#x7684;&#x521B;&#x6781;&#x901F;&#x5149;&#x8F6E;&#xFF1A;<a href="https://www.bilibili.com/video/av13333369" target="_blank">av13333369</a></p>
<p>&#x8FEA;&#x58EB;&#x5C3C;&#x7684;&#x5403;&#x7684;&#x771F;&#x7684;&#x9999;&#xFF01;&#x5C31;&#x7B97;&#x662F;80&#x591A;&#x4E00;&#x6839;&#x7684;&#x5927;&#x9E21;&#x817F;&#x8FD8;&#x662F;&#x6709;&#x4EBA;&#x6392;&#x5F88;&#x957F;&#x7684;&#x961F;&#x4F0D;&#x53BB;&#x4E70;&#xFF0C;&#x5C31;&#x662F;&#x771F;&#x9999;&#xFF0C;&#x82B1;&#x4E86;150&#x4E70;&#x4E86;&#x4E00;&#x4E9B;&#x5403;&#x7684;&#x3002;</p>
<p>&#x6392;&#x7684;&#x6700;&#x957F;&#x7684;&#x961F;&#x662F;&#x4E03;&#x4E2A;&#x5C0F;&#x77EE;&#x4EBA;&#x77FF;&#x8F66;&#xFF0C;&#x8DB3;&#x8DB3;&#x7AD9;&#x4E86;70&#x5206;&#x949F;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x6CE1;&#x6CE1;&#x9F99;&#x51B2;&#x5929;&#x8D5B;&#x8F66;&#x6211;&#x6CA1;&#x6562;&#x5750;&#xFF0C;&#x522B;&#x7684;&#x77E5;&#x540D;&#x9879;&#x76EE;&#x57FA;&#x672C;&#x4E0A;&#x90FD;&#x73A9;&#x4E86;&#x4E00;&#x904D;&#xFF0C;&#x4F46;&#x5F88;&#x53EF;&#x60DC;&#x53EA;&#x73A9;&#x4E86;&#x4E00;&#x904D;&#x3002;</p>
<p><img src="/posts/Shanghai/images/IMG_3536-1.jpg" alt></p>
<p>&#x77E5;&#x9053;&#x665A;&#x4E0A;&#x6709;&#x70DF;&#x82B1;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x51B3;&#x5B9A;&#x4E86;&#x8FD9;&#x4E00;&#x5929;&#x5F85;&#x5728;&#x8FEA;&#x58EB;&#x5C3C;&#x91CC;&#x4E0D;&#x8D70;&#x4E86;&#x3002;</p>
<p>&#x591C;&#x5149;&#x5E7B;&#x5F71;&#x79C0;&#x771F;&#x7684;&#x662F;&#x90A3;&#x79CD;&#x80FD;&#x770B;&#x54ED;&#x7684;&#x9707;&#x64BC;&#x3002;</p>
<p>&#x5370;&#x8C61;&#x6700;&#x6DF1;&#x7684;&#x5C31;&#x662F;20&#xFF1A;30&#x5E7B;&#x5F71;&#x79C0;&#x7ED3;&#x675F;&#x540E;&#x597D;&#x591A;&#x4EBA;&#x7AD9;&#x5728;&#x90A3;&#x91CC;&#x4E0D;&#x60F3;&#x8D70;&#xFF0C;&#x8FD8;&#x6709;&#x597D;&#x591A;&#x4EBA;&#x5728;&#x62CD;&#x7167;&#x3002;</p>
<hr>
<p><img src="/posts/Shanghai/images/IMG_3388-1.jpg" alt></p>
<p>&#x673A;&#x667A;&#x7684;&#x6211;&#x9009;&#x62E9;&#x7AD9;&#x5728;&#x5730;&#x94C1;&#x95E8;&#x53E3;&#x7B49;&#x4E0B;&#x4E00;&#x73ED;&#x8F66;&#x5728;&#x5C4F;&#x853D;&#x95E8;&#x6253;&#x5F00;&#x540E;&#x8DD1;&#x8FDB;&#x53BB;&#x62A2;&#x4E00;&#x4E2A;&#x5EA7;&#xFF0C;&#x8BF4;&#x7740;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x4E0D;&#x8981;&#x8138;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x7684;&#x817F;&#x771F;&#x7684;&#x7AD9;&#x4E0D;&#x52A8;&#x4E86;&#x2026;</p>
<p>&#x5982;&#x679C;&#x662F;&#x4E24;&#x4E2A;&#x4EBA;&#x4E00;&#x8D77;&#x53BB;&#x73A9;&#x7684;&#x8BDD;&#x4F1A;&#x66F4;&#x6709;&#x610F;&#x601D;&#x4E48;&#xFF1F;</p>
<hr>
<p><img src="/posts/Shanghai/images/IMG_3610-1.jpg" alt="Higher"></p>
<p>&#x4E0A;&#x6D77;&#x4E4B;&#x5DC5;&#x7684;&#x98CE;&#x666F;&#x5F88;&#x597D;&#xFF0C;&#x6211;&#x53BB;&#x7684;&#x90A3;&#x5929;&#x4E0D;&#x662F;&#x5F88;&#x6674;&#xFF0C;&#x8FDC;&#x5904;&#x7684;&#x5EFA;&#x7B51;&#x770B;&#x8D77;&#x6765;&#x6709;&#x4E9B;&#x6726;&#x80E7;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E0D;&#x5F71;&#x54CD;&#x89C2;&#x666F;&#x3002;</p>
<p>VR&#x4F53;&#x9A8C;&#x533A;&#x653E;&#x7740;AlanWalker&#x7684;Routine&#xFF0C;&#x542C;&#x7740;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x7684;&#x6B4C;&#x901B;&#x89C2;&#x5149;&#x5385;&#xFF0C;&#x5F88;&#x6709;&#x610F;&#x601D;&#x7684;&#x3002;</p>
<p><img src="/posts/Shanghai/images/IMG_3600-1.jpg" alt></p>
<p>&#x9646;&#x5BB6;&#x5634;&#x9644;&#x8FD1;&#x7684;&#x5403;&#x7684;&#x662F;&#x771F;&#x8D35;&#xFF0C;&#x997F;&#x7740;&#x809A;&#x5B50;&#x8DD1;&#x5230;&#x522B;&#x7684;&#x5730;&#x65B9;&#x5403;&#x7684;&#x5348;&#x996D;...</p>
<hr>
<p><img src="/posts/Shanghai/images/IMG_3906-1.jpg" alt="16&#x53F7;&#x7EBF;&#x91CE;&#x751F;&#x52A8;&#x7269;&#x56ED;&#x7AD9;"></p>
<p>&#x4E0B;&#x5348;&#x5750;&#x5730;&#x94C1;&#x53BB;&#x91CE;&#x751F;&#x52A8;&#x7269;&#x56ED;&#x3002;</p>
<p>&#x53C8;&#x56DE;&#x5230;&#x4E86;&#x9F99;&#x9633;&#x8DEF;&#x5730;&#x94C1;&#x7AD9;&#x3002;</p>
<p>16&#x53F7;&#x7EBF;&#x5206;&#x5927;&#x7AD9;&#x8F66;&#x5C0F;&#x7AD9;&#x8F66;&#xFF0C;&#x5927;&#x7AD9;&#x8F66;&#x4E0D;&#x505C;&#x91CE;&#x751F;&#x52A8;&#x7269;&#x56ED;&#x7AD9;&#xFF0C;&#x5F53;&#x65F6;&#x5DEE;&#x4E00;&#x70B9;&#x4E0A;&#x9519;&#x8F66;&#x3002;</p>
<p>&#x4E4B;&#x524D;&#x5728;&#x77E5;&#x4E4E;&#x4E0A;&#x89C1;&#x8FC7;&#x6709;&#x4EBA;&#x5410;&#x69FD;16&#x53F7;&#x7EBF;&#x8F66;&#x53A2;&#x5185;&#x5EA7;&#x6905;&#x8BBE;&#x8BA1;&#x7684;&#xFF0C;&#x7B49;&#x5750;&#x4E0A;&#x8F66;&#x540E;&#x624D;&#x611F;&#x53D7;&#x5230;&#x8FD9;&#x662F;&#x771F;&#x7684;&#x6324;&#x2026;</p>
<p>&#x5728;16&#x53F7;&#x7EBF;&#x4E0A;&#x67E5;&#x4E86;&#x82F1;&#x8BED;&#x56DB;&#x7EA7;&#x7684;&#x6210;&#x7EE9;&#xFF0C;&#x538B;&#x7EBF;&#x8FC7;&#xFF0C;&#x6210;&#x7EE9;&#x4E0D;&#x9AD8;&#x4E0D;&#x662F;&#x5F88;&#x6EE1;&#x610F;&#xFF0C;&#x4E0D;&#x8FC7;&#x60F3;&#x4E86;&#x60F3;&#x8003;&#x8BD5;&#x65F6;&#x81EA;&#x5DF1;&#x5728;&#x751F;&#x75C5;&#x4F4F;&#x9662;&#xFF0C;&#x7B97;&#x4F5C;&#x662F;&#x81EA;&#x5DF1;&#x4E3A;&#x81EA;&#x5DF1;&#x627E;&#x7684;&#x4E00;&#x4E2A;&#x501F;&#x53E3;&#x5427;&#x3002;</p>
<p>&#x91CE;&#x751F;&#x52A8;&#x7269;&#x56ED;&#x7AD9;&#x79BB;&#x52A8;&#x7269;&#x56ED;&#x95E8;&#x53E3;&#x7092;&#x9E21;&#x8FDC;&#xFF0C;&#x8D70;&#x7740;&#x53BB;&#x592A;&#x803D;&#x8BEF;&#x65F6;&#x95F4;&#x4E86;&#x3002;</p>
<p><img src="/posts/Shanghai/images/IMG_3646-1.jpg" alt></p>
<p>&#x7B49;&#x8D70;&#x5230;&#x52A8;&#x7269;&#x56ED;&#x7684;&#x65F6;&#x5019;&#x5DF2;&#x7ECF;&#x4E0B;&#x5348;2&#x70B9;&#x591A;&#x4E86;&#xFF0C;&#x5F00;&#x7535;&#x74F6;&#x8F66;&#x7684;&#x53F8;&#x673A;&#x603B;&#x5728;&#x63D0;&#x9192;&#x4ED6;&#x4EEC;&#x9A6C;&#x4E0A;&#x5C31;&#x4E0B;&#x73ED;&#x4E86;&#x8BA9;&#x6211;&#x4EEC;&#x8D76;&#x7D27;&#x901B;&#x5269;&#x4E0B;&#x7684;&#x666F;&#x70B9;&#x8FD9;&#x4E2A;&#x5F88;&#x70E6;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x540E;&#x6211;&#x53C8;&#x8D70;&#x7740;&#x5728;&#x56ED;&#x533A;&#x6E9C;&#x8FBE;&#x4E86;&#x4E00;&#x904D;&#x3002;</p>
<p>&#x57FA;&#x672C;&#x4E0A;&#x628A;&#x6240;&#x6709;&#x7684;&#x52A8;&#x7269;&#x90FD;&#x770B;&#x4E86;&#x4E00;&#x8FB9;&#xFF0C;&#x8868;&#x793A;&#x6211;&#x5DF2;&#x7ECF;&#x89C1;&#x8FC7;&#x8FD9;&#x4E9B;&#x52A8;&#x7269;&#x4E86;&#xFF0C;&#x5728;&#x516C;&#x56ED;&#x91CC;&#x6E9C;&#x8FBE;&#x4E00;&#x5927;&#x5708;&#x3002;</p>
<p>&#x7B49;&#x901B;&#x5B8C;&#x4E00;&#x5927;&#x5708;&#x4E4B;&#x540E;&#x52A8;&#x7269;&#x56ED;&#x91CC;&#x5DF2;&#x7ECF;&#x6CA1;&#x51E0;&#x4E2A;&#x4EBA;&#x4E86;&#xFF0C;</p>
<p><img src="/posts/Shanghai/images/IMG_3824-1.jpg" alt></p>
<p>&#x7AD9;&#x5728;&#x6865;&#x4E0A;&#x770B;&#x4E0B;&#x9762;&#x7684;&#x5929;&#x9E45;&#xFF0C;&#x9644;&#x8FD1;&#x7684;&#x97F3;&#x54CD;&#x5728;&#x653E;AlanWalker&#x7684;remix&#x8FC7;&#x7684;Faded&#xFF0C;&#x771F;&#x7684;&#x6211;&#x5F88;&#x559C;&#x6B22;&#x8FD9;&#x9996;&#x6B4C;&#x3002;</p>
<p>&#x6700;&#x540E;&#x82B1;&#x4E94;&#x5757;&#x94B1;&#x4E70;&#x5305;&#x9972;&#x6599;&#x5582;&#x5929;&#x9E45;&#xFF0C;&#x53C8;&#x4E70;&#x70B9;&#x7389;&#x7C73;&#x5582;&#x9E3D;&#x5B50;&#x2026;</p>
<p><img src="/posts/Shanghai/images/IMG_3875-1.jpg" alt></p>
<hr>
<p><img src="/posts/Shanghai/images/IMG_3987-1.jpg" alt></p>
<p>&#x665A;&#x4E0A;&#x5F00;&#x59CB;&#x4E0B;&#x96E8;&#xFF0C;&#x5750;&#x5730;&#x94C1;&#x56DE;&#x9646;&#x5BB6;&#x5634;&#x53BB;&#x4E86;&#x4E1C;&#x65B9;&#x660E;&#x73E0;&#xFF0C;&#x7531;&#x4E8E;&#x4E0B;&#x96E8;&#x73BB;&#x7483;&#x4E0A;&#x6709;&#x5F88;&#x591A;&#x6C34;&#x73E0;&#x6240;&#x4EE5;&#x6700;&#x521D;&#x9694;&#x7740;&#x7A97;&#x5B50;&#x62CD;&#x7684;&#x7167;&#x7247;&#x90FD;&#x6709;&#x4E9B;&#x6A21;&#x7CCA;&#x3002;</p>
<p>&#x4E1C;&#x65B9;&#x660E;&#x73E0;&#x8FD8;&#x6CA1;&#x6709;&#x5B66;&#x751F;&#x7968;&#x2026;</p>
<p>&#x6700;&#x5F00;&#x59CB;&#x89C9;&#x5F97;&#x597D;&#x4E8F;&#xFF0C;&#x82B1;&#x4E86;&#x597D;&#x591A;&#x94B1;&#x8FD8;&#x62CD;&#x4E0D;&#x4E86;&#x7167;&#x7247;&#xFF0C;&#x76F4;&#x5230;&#x540E;&#x6765;&#x6211;&#x5230;&#x4E86;&#x4E0B;&#x9762;&#x7684;&#x7A7A;&#x4E2D;&#x8D70;&#x5ECA;...</p>
<p><del>&#x5728;&#x8FEA;&#x58EB;&#x5C3C;&#x548C;&#x522B;&#x4EBA;&#x649E;&#x886B;&#x5C31;&#x7B97;&#x4E86;&#xFF0C;&#x7B2C;&#x4E8C;&#x5929;&#x5728;&#x4E1C;&#x65B9;&#x660E;&#x73E0;&#x53C8;&#x649E;&#x886B;&#xFF0C;&#x8FD8;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x554A;&#x4E16;&#x754C;&#x771F;&#x5C0F;&#x3002;</del></p>
<p>&#x5728;&#x4E1C;&#x65B9;&#x660E;&#x73E0;&#x4E0A;&#x5F85;&#x4E86;&#x5F88;&#x4E45;&#xFF0C;&#x53C2;&#x89C2;&#x4E86;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x9879;&#x76EE;&#xFF0C;&#x5750;&#x4E86;&#x4E00;&#x628A;VR&#x8FC7;&#x5C71;&#x8F66;&#xFF08;&#x6B63;&#x597D;&#x8D76;&#x4E0A;&#x6700;&#x540E;&#x4E00;&#x8D9F;&#xFF09;&#xFF0C;&#x5F88;&#x665A;&#x624D;&#x56DE;&#x5230;&#x65C5;&#x5E97;&#x3002;</p>
<p><img src="/posts/Shanghai/images/IMG_4071-1.jpg" alt></p>
<hr>
<p><img src="/posts/Shanghai/images/4.jpg" alt="Bilibili"></p>
<p>&#x7B2C;&#x4E09;&#x5929;&#x662F;&#x5148;&#x5750;11&#x53F7;&#x7EBF;&#x5230;&#x6C5F;&#x82CF;&#x8DEF;&#x6362;&#x4E8C;&#x53F7;&#x7EBF;&#x7136;&#x540E;&#x6362;&#x56DB;&#x53F7;&#x7EBF;&#x7136;&#x540E;&#x6362;&#x5341;&#x53F7;&#x7EBF;&#x2026;</p>
<p><del>&#x6B22;&#x8FCE;&#x60A8;&#x4E58;&#x5750;&#x8F68;&#x9053;&#x4EA4;&#x901A;&#x56DB;&#x53F7;&#x7EBF;&#xFF0C;&#x672C;&#x7EBF;&#x73AF;&#x7EBF;&#x672C;&#x7EBF;&#x73AF;&#x7EBF;&#x672C;&#x7EBF;&#x73AF;&#x7EBF;&#x672C;&#x7EBF;&#x73AF;&#x7EBF;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#x2026;&#x2026;</del></p>
<p>&#x50BB;&#x4E4E;&#x4E4E;&#x7684;&#x9A91;&#x5171;&#x4EAB;&#x5355;&#x8F66;&#x8DD1;&#x53BB;B&#x7AD9;&#x603B;&#x90E8;&#x901B;&#x4E86;&#x4E00;&#x5927;&#x5708;&#xFF0C;&#x95EE;&#x4E86;&#x4E00;&#x4E0B;&#x524D;&#x53F0;&#x5C0F;&#x59D0;&#x59D0;&#x53EA;&#x80FD;&#x53C2;&#x89C2;&#x4E00;&#x697C;&#x5927;&#x5385;&#x540E;&#x53BB;&#x4E86;&#x5496;&#x5561;&#x5385;&#x82B1;&#x4E86;50&#x5757;&#x94B1;&#x4E70;&#x4E00;&#x676F;&#x5C0F;&#x7535;&#x89C6;&#x5496;&#x5561;&#xFF08;&#x5FD8;&#x8BB0;&#x53EB;&#x4EC0;&#x4E48;&#x540D;&#x5B57;&#x4E86;&#xFF09;&#x540E;&#x542B;&#x6CEA;&#x628A;&#x5B83;&#x559D;&#x6389;&#x2026;</p>
<p><img src="/posts/Shanghai/images/3.jpg" alt></p>
<p>&#x592A;&#x597D;&#x5403;&#x4E86;&#x545C;&#x545C;&#x545C;&#x545C;&#x545C;&#x2026;</p>
<p>&#x8FD8;&#x771F;&#x4E0D;&#x662F;Bilibili&#x4F1A;&#x5458;&#x8D2D;&#x9A97;&#x6B7B;&#x80A5;&#x5B85;&#x94B1;&#x2026;</p>
<p>&#x6240;&#x4EE5;&#x6211;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x6709;&#x4E70;&#x3002;</p>
<p><img src="/posts/Shanghai/images/2.jpg" alt></p>
<p>&#x4E0B;&#x5348;&#x5F00;&#x59CB;&#x4E0B;&#x96E8;&#xFF0C;&#x61D2;&#x5F97;&#x62FF;&#x76F8;&#x673A;&#xFF0C;&#x4E5F;&#x6CA1;&#x600E;&#x4E48;&#x7528;&#x624B;&#x673A;&#x62CD;&#x7167;&#xFF0C;&#x5C31;&#x987A;&#x7740;&#x5730;&#x94C1;&#x7EBF;&#x8DEF;&#x4F9D;&#x6B21;&#x53BB;&#x4E86;&#x8D9F;&#x540C;&#x6D4E;&#xFF0C;&#x4EA4;&#x5927;&#xFF0C;&#x987A;&#x8DEF;&#x53BB;&#x4E86;&#x6B66;&#x5EB7;&#x5927;&#x697C;&#xFF0C;&#x53C2;&#x89C2;&#x4E86;&#x5B8B;&#x5E86;&#x9F84;&#x6545;&#x5C45;&#x3002;&#x6700;&#x540E;&#x53BB;&#x4E86;&#x5E08;&#x8303;&#x5927;&#xFF0C;&#x6CA1;&#x6709;&#x53BB;&#x590D;&#x65E6;&#x56E0;&#x4E3A;&#x65F6;&#x95F4;&#x4E0D;&#x591F;&#x4E86;&#x3002;</p>
<p>&#x901B;&#x90A3;&#x4E9B;&#x6821;&#x56ED;&#x7684;&#x65F6;&#x5019;&#x53EA;&#x662F;&#x6253;&#x7740;&#x4F1E;&#x8FDB;&#x53BB;&#x8D70;&#x4E86;&#x4E00;&#x5708;&#x4EE3;&#x8868;&#x54E6;&#x6211;&#x5DF2;&#x7ECF;&#x6765;&#x8FC7;&#x8FD9;&#x91CC;&#x4E86;&#xFF0C;&#x4E00;&#x5F20;&#x7167;&#x7247;&#x90FD;&#x6CA1;&#x6709;&#x62CD;&#x3002;</p>
<p>&#x53BB;&#x540C;&#x6D4E;&#x65F6;&#x6B63;&#x8D76;&#x4E0A;&#x5F00;&#x5B66;&#xFF0C;&#x53BB;&#x770B;&#x4E86;&#x4E00;&#x773C;&#x6A31;&#x82B1;&#x6811;&#x8FD8;&#x6CA1;&#x6709;&#x5F00;&#xFF0C;&#x5C31;&#x5306;&#x5306;&#x8D70;&#x4E86;&#x3002;</p>
<p>&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x591A;&#x62BD;&#x51FA;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#x8BA9;&#x81EA;&#x5DF1;&#x8D70;&#x5728;&#x8857;&#x4E0A;&#x95F2;&#x901B;&#x7F62;&#x4E86;&#x2026;</p>
<p>&#x597D;&#x591A;&#x65F6;&#x95F4;&#x90FD;&#x662F;&#x5728;&#x5730;&#x94C1;&#x4E0A;&#x5EA6;&#x8FC7;&#x7684;&#x3002;</p>
<p><img src="/posts/Shanghai/images/IMG_4125-1.jpg" alt></p>
<p>&#x60F3;&#x4E86;&#x60F3;&#x660E;&#x5929;&#x5C31;&#x8981;&#x5750;&#x98DE;&#x673A;&#x56DE;&#x5BB6;&#x4E86;&#x6240;&#x4EE5;&#x5185;&#x5FC3;&#x5F88;&#x662F;&#x4E0D;&#x820D;&#x665A;&#x4E0A;&#x53C8;&#x5750;&#x5730;&#x94C1;&#x53BB;&#x4E86;&#x57CE;&#x968D;&#x5E99;&#xFF08;&#x8C6B;&#x56ED;&#xFF09;&#xFF0C;&#x5403;&#x4E86;&#x8C6B;&#x56ED;&#x5356;&#x7684;&#x7279;&#x522B;&#x96BE;&#x5403;&#x7684;&#x5C0F;&#x5403;&#x540E;&#xFF08;&#x7EC8;&#x4E8E;&#x660E;&#x767D;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0A;&#x6D77;&#x672C;&#x5730;&#x4EBA;&#x51E0;&#x4E4E;&#x4E0D;&#x53BB;&#x8C6B;&#x56ED;&#x8FD9;&#x4E2A;&#x5730;&#x65B9;&#x4E86;&#xFF09;&#x56DE;&#x65C5;&#x5E97;&#x65E9;&#x65E9;&#x7761;&#x89C9;&#x4E3A;&#x660E;&#x5929;&#x65E9;&#x8D77;&#x505A;&#x51C6;&#x5907;&#x2026;</p>
<p>&#x56E0;&#x4E3A;&#x8D77;&#x5E8A;&#x665A;&#x4E86;&#x4E3A;&#x4E86;&#x8D76;&#x65F6;&#x95F4;&#x5750;&#x7684;&#x78C1;&#x60AC;&#x6D6E;&#x53BB;&#x7684;&#x666E;&#x901A;&#x56FD;&#x9645;&#x59EC;&#x573A;&#xFF08;&#x96FE;&#xFF09;&#xFF0C;&#x6CA1;&#x6709;&#x5750;&#x4E8C;&#x53F7;&#x7EBF;&#x5E7F;&#x5170;&#x8DEF;&#x5230;&#x6D66;&#x4E1C;&#x56FD;&#x9645;&#x673A;&#x573A;&#x7684;&#x5EF6;&#x7EBF;&#x6709;&#x4E9B;&#x53EF;&#x60DC;&#x3002;</p>
<p><img src="/posts/Shanghai/images/6.jpg" alt></p>
<p>&#x98DE;&#x673A;&#x5373;&#x5C06;&#x964D;&#x843D;&#x65F6;&#x5728;&#x57CE;&#x5E02;&#x4E0A;&#x7A7A;&#x7ED5;&#x4E86;&#x597D;&#x51E0;&#x5708;&#xFF0C;&#x4F53;&#x9A8C;&#x4E86;&#x597D;&#x51E0;&#x6B21;&#x5931;&#x91CD;&#x7684;&#x611F;&#x89C9;&#xFF08;&#x592A;&#x597D;&#x73A9;&#x4E86;&#x6211;&#x8FD8;&#x8981;&#x73A9; #&#x556A;&#xFF09;</p>
<hr>
<p>&#x6240;&#x4EE5;&#x5E9F;&#x4E86;&#x597D;&#x957F;&#x65F6;&#x95F4;&#x624D;&#x628A;&#x8FD9;&#x4E9B;&#x5199;&#x51FA;&#x6765;&#xFF0C;&#x6700;&#x5F00;&#x59CB;&#x662F;&#x6CA1;&#x60F3;&#x628A;&#x8FD9;&#x6B21;&#x65C5;&#x884C;&#x5199;&#x5728;Blog&#x91CC;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x60F3;&#x4E86;&#x5F88;&#x4E45;&#x53C8;&#x6709;&#x4E9B;&#x4E0D;&#x7518;&#x5FC3;&#x3002;</p>
<p>&#x7167;&#x7247;&#x8D28;&#x91CF;&#x4E0D;&#x9AD8;&#xFF0C;&#x4E3A;&#x4E86;&#x52A0;&#x8F7D;&#x901F;&#x5EA6;&#x56FE;&#x7247;&#x90FD;&#x88AB;&#x6211;&#x72E0;&#x7684;&#x538B;&#x4E86;&#x4E00;&#x904D;&#xFF0C;&#x90FD;&#x662F;&#x5306;&#x5306;&#x5FD9;&#x5FD9;&#x62CD;&#x7684;&#x3002;</p>
<p>&#x5FD8;&#x8BB0;&#x5E26;&#x964D;&#x566A;&#x8033;&#x673A;&#x53BB;&#x4E0A;&#x6D77;&#x6709;&#x4E9B;&#x53EF;&#x60DC;&#x3002;&#x73B0;&#x5728;&#x8D8A;&#x6765;&#x8D8A;&#x610F;&#x8BC6;&#x5230;&#x964D;&#x566A;&#x8033;&#x673A;&#x5BF9;&#x6211;&#x7684;&#x91CD;&#x8981;&#x6027;&#x4E86;&#x3002;</p>
<p>&#x6709;&#x65F6;&#x5019;&#x771F;&#x7684;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x662F;&#x592A;&#x7D2F;&#x4E86;&#x3002;</p>
<p>&#x81EA;&#x5DF1;&#x6CA1;&#x6709;&#x5BDF;&#x89C9;&#x51FA;&#x6765;&#x81EA;&#x5DF1;&#x7684;&#x8EAB;&#x4F53;&#x5DF2;&#x7ECF;&#x53D7;&#x635F;&#x8FD9;&#x4E48;&#x4E25;&#x91CD;&#x4E86;&#x3002;&#x8FD9;&#x4E5F;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x9009;&#x62E9;&#x8BA9;&#x81EA;&#x5DF1;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x53BB;&#x4F11;&#x606F;&#x4E00;&#x4E0B;&#x7684;&#x539F;&#x56E0;&#x5427;&#x3002;</p>
<p>&#x72B9;&#x8C6B;&#x4E86;&#x534A;&#x4E2A;&#x5B66;&#x671F;&#x7EC8;&#x4E8E;&#x8FD8;&#x662F;&#x4E0B;&#x5B9A;&#x51B3;&#x5FC3;&#x8981;&#x8F6C;&#x4E13;&#x4E1A;&#x4E86;&#xFF0C;&#x81EA;&#x5DF1;&#x9020;&#x4E0B;&#x7684;&#x5B7D;&#x5C31;&#x81EA;&#x5DF1;&#x4E00;&#x70B9;&#x70B9;&#x8FD8;&#x5427;&#x3002;</p>
<p>&#x6CA1;&#x6709;&#x6BD4;&#x8FD9;&#x66F4;&#x7CDF;&#x7CD5;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#x5427;&#x3002;</p>
<p>&#x660E;&#x660E;&#x8FD9;&#x4E9B;&#x90FD;&#x4E0D;&#x662F;&#x6211;&#x60F3;&#x8981;&#x7684;&#xFF0C;&#x4F46;&#x4E3A;&#x4EC0;&#x4E48;&#x81EA;&#x5DF1;&#x4F1A;&#x6709;&#x79CD;&#x4E50;&#x5728;&#x5176;&#x4E2D;&#x5462;&#xFF1F;</p>
<p>&#x6BD5;&#x7ADF;&#x8FD9;&#x90E8;&#x5206;&#x5927;&#x8111;&#x4E5F;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x603B;&#x4E0D;&#x80FD;&#x56E0;&#x4E3A;&#x5B83;&#x6240;&#x4E3A;&#x81EA;&#x5DF1;&#x5E26;&#x6765;&#x7684;&#x8D1F;&#x9762;&#x5F71;&#x54CD;&#x5C31;&#x9009;&#x62E9;&#x81EA;&#x6B8B;&#x5427;&#x3002;</p>
<p>&#x6700;&#x8FD1;&#x5728;&#x770B;&#x7A7A;&#x4E4B;&#x5883;&#x754C;&#x3002;&#x4E0E;&#x5176;&#x8BF4;&#x5728;&#x770B;&#xFF0C;&#x4E0D;&#x5982;&#x8BF4;&#x81EA;&#x5DF1;&#x662F;&#x4E3A;&#x4E86;&#x5B8C;&#x6210;&#x770B;&#x756A;&#x5267;&#x8FD9;&#x4EFB;&#x52A1;&#x800C;&#x5728;&#x770B;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x5267;&#x60C5;&#x4E5F;&#x770B;&#x4E0D;&#x61C2;&#xFF0C;&#x4E3B;&#x89D2;&#x8BF4;&#x7684;&#x8BDD;&#x4E5F;&#x6CA1;&#x600E;&#x4E48;&#x8BB0;&#x4F4F;&#xFF0C;&#x5C31;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x8FC7;&#x4E00;&#x904D;&#x80FD;&#x53EB;&#x505A;&#x770B;&#x4E48;&#xFF1F;</p>
<p>&#x6700;&#x8FD1;&#x81EA;&#x5DF1;&#x5E72;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x90FD;&#x662F;&#x8FD9;&#x6837;&#x554A;&#x3002;</p>
<p>&#x6CA1;&#x6709;&#x80FD;&#x8BA9;&#x81EA;&#x5DF1;&#x5F00;&#x5FC3;&#x8D77;&#x6765;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x8981;&#x5728;&#x522B;&#x4EBA;&#x9762;&#x524D;&#x8868;&#x73B0;&#x51FA;&#x5F00;&#x5FC3;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x8368;&#x9EBB;&#x75B9;&#x5230;&#x73B0;&#x5728;&#x90FD;&#x6CA1;&#x6709;&#x597D;&#x8F6C;&#x7684;&#x8FF9;&#x8C61;&#x5DF2;&#x7ECF;&#x8868;&#x660E;&#x81EA;&#x5DF1;&#x8EAB;&#x4F53;&#x72B6;&#x51B5;&#x5F88;&#x5DEE;&#x4E86;&#x3002;</p>
<p>&#x5E9F;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#x529B;&#x6C14;&#x53BB;&#x4E89;&#x6C42;&#x4E9B;&#x4EC0;&#x4E48;&#x5374;&#x53C8;&#x4E0D;&#x77E5;&#x9053;&#x7A76;&#x7ADF;&#x60F3;&#x8981;&#x4EC0;&#x4E48;&#x3002;</p>
<p>&#x6574;&#x5929;&#x751F;&#x6D3B;&#x5728;&#x7761;&#x7720;&#x4E0D;&#x8DB3;&#x5934;&#x8111;&#x6DF7;&#x4E71;&#x7684;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x8FD8;&#x8981;&#x4E3A;&#x4E00;&#x4E9B;&#x4E8B;&#x7269;&#x8868;&#x73B0;&#x51FA;&#x4E00;&#x5E45;&#x5F88;&#x52AA;&#x529B;&#x7684;&#x6837;&#x5B50;&#x7ED9;&#x522B;&#x4EBA;&#x770B;&#x3002;</p>
<p>&#x5F88;&#x4E45;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x5F00;&#x5FC3;&#x7684;&#x611F;&#x89C9;&#x4E86;&#x3002;</p>
<p>&#x603B;&#x5728;&#x751F;&#x6C14;&#x662F;&#x5BF9;&#x8EAB;&#x4F53;&#x4E0D;&#x597D;&#x7684;&#x3002;</p>
<p>&#x53C8;&#x8981;&#x53BB;&#x4E0A;&#x90A3;&#x4E9B;&#x6CA1;&#x7528;&#x7684;&#x8BFE;&#x4E86;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x6837;&#x7684;&#x751F;&#x6D3B;&#x4F1A;&#x6301;&#x7EED;&#x591A;&#x4E45;&#x3002;</p>
<div class="alert-green">&#x6700;&#x540E;&#x66F4;&#x65B0;&#x65E5;&#x671F;&#xFF1A;2019&#x5E74;4&#x6708;22&#x65E5;</div>

    </main>
    <footer class="post-footer">
      
      <div class="post-tags">
        <a class="post-tag button" href="/tags/%E4%B8%80%E4%B8%AA%E4%BA%BA%E7%9A%84%E6%97%85%E8%A1%8C/" rel="tag"><i class="fas fa-tag"></i>一个人的旅行</a><a class="post-tag button" href="/tags/%E7%90%90%E4%BA%8B/" rel="tag"><i class="fas fa-tag"></i>琐事</a><a class="post-tag button" href="/tags/%E6%91%84%E5%BD%B1/" rel="tag"><i class="fas fa-tag"></i>摄影</a>
      </div>
      
    </footer>
  </article>
  
  <nav class="page-nav">
    <div class="page-nav-next page-nav-item">
      
    </div>
    <div class="page-nav-prev page-nav-item">
      
      <a href="/posts/Xiaomi_Miwifi_3G/" rel="prev" title="小米路由器3G折腾之刷OpenWrt/Pandavan记录"><span class="nav-title">小米路由器3G折腾之刷OpenWrt/Pandavan记录</span><i class="fas fa-angle-right"></i></a>
      
    </div>
  </nav>
  
  
<div class="reward" id="reward">
  <p>自动售卖机卖的摩卡咖啡超好喝！！</p>
  <button id="reward-button" class="button" disable="enable"><i class="fas fa-donate"></i>Reward</button>
  <div id="qr" class="qr" style="display: none;" aria-hidden="true">
    
    <div id="wechat">
      <img id="wechat_qr" src="/images/wechat.jpg" alt="WechatPay"/>
      <span>WechatPay</span>
    </div>
    
    
    <div id="alipay">
      <img id="alipay_qr" src="/images/alipay.jpg" alt="AliPay"/>
      <span>AliPay</span>
    </div>
    
    
  </div>
</div>


  
  
  
  

<div class="comments" id="comments">
  
  <div class="commentjs" id="comment-thread"></div>
  <link rel="stylesheet" href="/css/commentjs.css">
  <script defer type="text/javascript" src="/js/marked.min.js"></script>
  <script defer type="text/javascript" src="/js/timeago.min.js"></script>
  <script defer type="text/javascript" src="/js/highlight.min.js"></script>
  <script defer type="text/javascript" src="/js/commentjs.js"></script>
  <script type="text/javascript">
  $(document).ready(function () {
    getComments({
      "type": "github",
      "user": "STARRY-S",
      "repo": "blog.starry-s.xyz",
      "clientID": "d840b2424099ff5195ff",
      "clientSecret": "cc22cbdcdee59b64ef1031c4d369821030b3634f",
      "no_comment": "This page has no comment, go to comment now!",
      "go_to_comment": "Go to Comment",
      "issue_title": "一个人的旅行 —— 上海",
      "btn_class": "button",
      "comments_target": "#comment-thread"
    });
    marked.setOptions({
      "highlight": function (code, lang) {
        return hljs.highlightAuto(code).value;
      }
    });
    function mark() {
      var markdowns = document.getElementsByClassName("markdown");
      for (var i = 0; i < markdowns.length; ++i){
        if (markdowns[i].innerHTML) {
          markdowns[i].innerHTML = marked(markdowns[i].innerHTML);
        }
      }
    }
    window.addEventListener("DOMContentLoaded", mark, false);
    window.addEventListener("load", mark, false);
  });
  </script>
  
</div>



  
</div>

          </div>
          
          
          
<aside class="sidebar" id="sidebar" style="background: url(/images/background.png);">
  
  <div class="search">
    <div class="form-group">
      <i class="fas fa-search"></i><input type="search" id="search-input" name="q" results="0" placeholder="Search" class="form-control"/>
    </div>
  </div>
  <div class="search-result-box" id="search-result"></div>
  
  
<div class="info sidebar-item" id="info">
  
  <img class="author-avatar" src="/images/avatar.jpg" alt="STARRY-S">
  
  <h1 class="author-name">STARRY-S</h1>
  <h2 class="author-description">How beautiful this world is.</h2>
  <div class="site-count">
    
    
    
    
    <div class="archives-count count-block">
      <div class="site-count-title">Archives</div>
      <div><a href="/archives/">18</a></div>
    </div>
    
    
    
    <div class="categories-count count-block">
      <div class="site-count-title">Categories</div>
      <div><a href="/categories/">15</a></div>
    </div>
    
    
    
    <div class="tags-count count-block">
      <div class="site-count-title">Tags</div>
      <div><a href="/tags/">25</a></div>
    </div>
    
    
    
    
  </div>
  
  <div class="rss">
    <a class="rss-link button sidebar-item" href="/atom.xml"><i class="fas fa-rss"></i>RSS</a>
  </div>
  
</div>


  <div class="sidebar-sticky">
    
    
    
    
    <hr>
    <div class="social-link sidebar-item">
      <div><i class="far fa-address-card"></i>Social Links</p></div>
      <ul>
        
        <li><i class="fas fa-envelope"></i><a href="mailto:hx916584160@gmail.com" target="_blank">E-Mail</a></li>
        
        <li><i class="fab fa-github"></i><a href="https://github.com/STARRY-S" target="_blank">GitHub</a></li>
        
        <li><i class="fab fa-telegram"></i><a href="https://t.me/STARRY-S" target="_blank">Telegram</a></li>
        
      </ul>
    </div>
    
    
    <hr>
    <div class="blogroll sidebar-item">
      <div><i class="fas fa-user-friends"></i>Blogroll</div>
      <ul>
        
        <li><i class="fas fa-link"></i><a href="https://alynx.xyz/" target="_blank">喵's HomePage</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://chenxy.moe" target="_blank">Art_Chen's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://lgiki.cc" target="_blank">LGiki's Blog</a></li>
        
      </ul>
    </div>
    
  </div>
</aside>


          
        </div>
      </div>
    </main>
    
<footer id="footer" class="footer" style="background: #1c0b2b;">
  <div class="container">
    <div class="back-to-top">
      <button id="back-to-top"><i class="fas fa-angle-double-up" aria-label="Back to Top"></i></button>
    </div>
    <div class="footer-container">
      <div class="footer-left">
        <div class="copyright">
          <span class="author"><i class="far fa-edit"></i>STARRY-S</span><span class="years"><i class="far fa-copyright"></i><span id="years-text">2016</span></span><span class="creative-commons"><i class="fab fa-creative-commons"></i><a href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">BY-NC-SA 4.0</a></span>
        </div>
        
        <div class="busuanzi">
          <span id="busuanzi_container_site_pv"><i class="fas fa-eye" aria-label="Site Visit Count" aria-hidden="false"></i><span id="busuanzi_value_site_pv"></span></span><span id="busuanzi_container_site_uv"><i class="fas fa-user" aria-label="Site User Count" aria-hidden="false"></i><span id="busuanzi_value_site_uv"></span></span><span id="busuanzi_container_page_pv"><i class="fas fa-file-alt"></i><span id="busuanzi_value_page_pv" aria-label="Page Click Count" aria-hidden="false"></span></span>
        </div>
        
      </div>
      <div class="footer-right">
        <div class="custom-info">
          
          Powered by<i class="fab fa-github-alt"></i><a href="https://pages.github.com/" target="_blank">Github Pages</a>
          
        </div>
        <div class="powered-by">
          Proudly Powered by <a href="https://github.com/AlynxZhou/hikaru/" target="_blank">Hikaru</a><i class="fab fa-node-js"></i>Theme is <a href="https://github.com/AlynxZhou/hikaru-theme-aria/" target="_blank">ARIA</a>
        </div>
      </div>
    </div>
  </div>
</footer>


  </body>
</html>
<!-- Page built by Hikaru v1.13.3 at 2019-04-22 Mon 15:09:55 CST. -->
