<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
    <meta name="theme-color" content="#33363b">
    <meta name="msapplication-TileColor" content="#33363b">
    
    
    
    <meta name="keywords" content="Life, ARIA, Hikaru, STARRY-S">
    
    
    <link rel="apple-touch-icon" sizes="180x180" href="/favicons/apple-touch-icon.png">
    
    
    <link rel="icon" type="image/png" sizes="192x192" href="/favicons/android-chrome-192x192.png">
    
    
    <link rel="icon" type="image/png" sizes="32x32" href="/favicons/favicon-32x32.png">
    
    
    <link rel="icon" type="image/png" sizes="16x16" href="/favicons/favicon-16x16.png">
    
    
    <link rel="mask-icon" href="/favicons/safari-pinned-tab.svg" color="#33363b">
    
    
    <link rel="manifest" href="/favicons/site.webmanifest">
    
    
    <meta name="msapplication-config" content="/favicons/browserconfig.xml">
    
    
    <link rel="shortcut icon" type="image/x-icon" href="/favicons/favicon.ico">
    
    
    <link rel="alternate" href="/atom.xml" title="STARRY-S' Blog" type="application/atom+xml" />
    
    
    <link rel="stylesheet" type="text/css" href="/css/normalize.css">
    <link rel="stylesheet" type="text/css" href="/css/index.css">
    
    <link rel="stylesheet" type="text/css" href="/css/sidebar.css">
    
    
<link rel="stylesheet" type="text/css" href="/css/page.css">
<link rel="stylesheet" type="text/css" href="/css/post.css">

    <link rel="stylesheet" type="text/css" href="/css/custom.css">
    <link rel="stylesheet" type="text/css" href="/css/atom-one-dark.css">
    <link rel="stylesheet" type="text/css" href="/css/lightgallery.min.css">
    <script type="text/javascript" src="/js/jquery.min.js"></script>
    <script defer type="text/javascript" src="/js/util.js"></script>
    <script defer type="text/javascript" src="/js/scrollspy.js"></script>
    <script defer type="text/javascript" src="/js/fontawesome-all.min.js"></script>
    <script defer type="text/javascript" src="/js/lightgallery.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-fullscreen.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-hash.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-pager.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-thumbnail.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-zoom.min.js"></script>
    
    <script defer src="/js/busuanzi.pure.mini.js"></script>
    
    
    <script defer type="text/javascript" src="/js/search.js"></script>
    <script type="text/javascript">
    $(document).ready(function () {
      var searchPath = "/search.json";
      if ("search.json".length === 0) {
        searchPath = "/search.json";
      }
      searchFunc(searchPath, "search-input", "search-result");
    });
    </script>
    
    
    <script defer type="text/javascript" src="/js/index.js"></script>
    
    <script defer type="text/javascript" src="/js/custom.js"></script>
    <title>Sorry & Thankyou. | STARRY-S' Blog - Lifeline</title>
  </head>
  <body itemscope itemtype="http://schema.org/WebPage" lang="en"  data-spy="scroll" data-target=".list-group">
    
<header id="header" class="header" style="background: #33363b;">
  <div class="container">
    <div class="header-container">
      <div class="header-title">
        <h1 class="title"><a href="/">STARRY-S' Blog</a></h1>
        <h2 class="subtitle">Lifeline</h2>
      </div>
      
      <div class="logo">
        <img src="/images/logo.png" alt="logo">
      </div>
      
    </div>
    <nav id="nav" class="nav">
      <a id="nav-toggle" class="nav-toggle" aria-hidden="true"><i class="fas fa-bars" aria-label="Toggle Navbar"></i></a>
      <ul id="menu" role="menubar" aria-hidden="false">
        
        <li role="menuitem"><a href="/"><i class="fas fa-home"></i><span class="menu-text">Home</span></a></li>
        
        <li role="menuitem"><a href="/archives/"><i class="fas fa-archive"></i><span class="menu-text">Archives</span></a></li>
        
        <li role="menuitem"><a href="/categories/"><i class="fas fa-th-list"></i><span class="menu-text">Categories</span></a></li>
        
        <li role="menuitem"><a href="/tags/"><i class="fas fa-tags"></i><span class="menu-text">Tags</span></a></li>
        
        <li role="menuitem"><a href="/about/"><i class="fas fa-user-edit"></i><span class="menu-text">About</span></a></li>
        
      </ul>
    </nav>
    <!-- Global site tag (gtag.js) - Google Analytics -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-124615792-1"></script>
    <script>
      window.dataLayer = window.dataLayer || [];
      function gtag(){dataLayer.push(arguments);}
      gtag('js', new Date());

      gtag('config', 'UA-124615792-1');
    </script>

  </div>
</header>


    <main id="main" class="main">
      <div class="container">
        <div class="main-container">
          <div class="content">
            
<div id="post" class="page">
  <article class="article post card" itemscope itemtype="http://schema.org/Article">
    <div class="post-block">
      <link itemprop="mainEntityOfPage" href="https://blog.starry-s.xyz/posts/sorry-thankyou/">
      <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
        <meta itemprop="name" content="STARRY-S">
        <meta itemprop="description" content="">
        <meta itemprop="image" content="/images/avatar.png">
      </span>
      <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
        <meta itemprop="name" content="STARRY-S' Blog">
      </span>
    </div>
    <header class="post-header">
      <h1 class="post-title" itemprop="name headline">Sorry & Thankyou.</h1>
      <div class="post-meta">
        
        <span class="post-date meta-block">
          <i class="far fa-calendar-plus"></i><span><time title="post-date" itemprop="dateCreated datePublished" datetime="2016-11-26T07:00:24.000Z">2016-11-26 Sat 15:00:24 CST</time></span>
        </span>
        
        
        <span class="post-categories meta-block">
          
          <i class="far fa-folder-open"></i><span itemprop="about" itemscope itemtype="http://schema.org/Thing"><a href="/categories/%E7%90%90%E4%BA%8B/" itemprop="url" rel="index"><span itemprop="name">琐事</span></a></span><i class="fas fa-angle-right"></i><span itemprop="about" itemscope itemtype="http://schema.org/Thing"><a href="/categories/%E7%90%90%E4%BA%8B/%E7%A2%8E%E7%A2%8E%E5%BF%B5/" itemprop="url" rel="index"><span itemprop="name">碎碎念</span></a></span>
        </span>
        
        
        
        
      </div>
    </header>
    <main class="post-main" itemprop="articleBody">
      <p>&#x60F3;&#x4E86;&#x5F88;&#x4E45;&#x4E0D;&#x77E5;&#x9053;&#x4EE5;&#x4EC0;&#x4E48;&#x6765;&#x4F5C;&#x4E3A;&#x672C;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x5F00;&#x5934;&#xFF0C;&#x4E0D;&#x786E;&#x5B9A;&#x81EA;&#x5DF1;&#x771F;&#x7684;&#x60F3;&#x8BF4;&#x4E9B;&#x4EC0;&#x4E48;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x8FD8;&#x662F;&#x5E26;&#x7740;&#x786E;&#x5207;&#x76EE;&#x7684;&#x6765;&#x5199;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x3002;</p>
<p>&#x8FD9;&#x4E00;&#x4E2A;&#x6708;&#x53D1;&#x751F;&#x4E86;&#x4E00;&#x4E9B;&#x4E0D;&#x592A;&#x6109;&#x5FEB;&#x7684;&#x4E8B;&#xFF0C;&#x53EF;&#x80FD;&#x4E0D;&#x7B97;&#x5F88;&#x5927;&#x5427;&#x4F46;&#x662F;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x8FD9;&#x4E2A;&#x5F71;&#x54CD;&#x771F;&#x7684;&#x5F88;&#x5927;&#x3002;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x5E94;&#x8BE5;&#x4ECE;&#x4F55;&#x8BF4;&#x8D77;&#xFF0C;&#x5148;&#x9759;&#x4E0B;&#x6765;&#x5E26;&#x4E0A;&#x8033;&#x673A;&#x6162;&#x6162;&#x7684;&#x60F3;&#x6162;&#x6162;&#x7684;&#x5199;&#x3002;</p>
<p><img src="/posts/sorry-thankyou/images/snow.jpg" alt="Snow"></p>
<a id="more"></a>


<hr>
<p>&#x4E00;&#x76F4;&#x6CA1;&#x60F3;&#x5230;&#x6709;&#x4E9B;&#x4E8B;&#x53D1;&#x751F;&#x7684;&#x8FD9;&#x4E48;&#x5FEB;&#xFF0C;&#x77ED;&#x77ED;4&#x4E2A;&#x6708;&#x53D1;&#x751F;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#x53D8;&#x5316;&#x3002;</p>
<p>&#x8FD8;&#x8BB0;&#x5F97;4&#x4E2A;&#x6708;&#x524D;&#x8FD8;&#x5728;&#x5FD9;&#x5C0F;&#x8003;&#x8BD5;&#x7684;&#x90A3;&#x9635;&#x5B50;&#xFF0C;&#x8FD9;&#x53EA;&#x732B;&#x5C31;&#x8FD9;&#x4E48;&#x6765;&#x5230;&#x4E86;&#x6211;&#x7684;&#x751F;&#x6D3B;&#x4E2D;&#x3002;</p>
<p>4&#x4E2A;&#x6708;&#x5B83;&#x53D8;&#x5316;&#x5F88;&#x5927;&#xFF0C;&#x957F;&#x5927;&#x4E86;&#x8BB8;&#x591A;&#xFF0C;&#x4ECE;&#x4E00;&#x53EA;&#x51E0;&#x65A4;&#x91CD;&#x7684;&#x5C0F;&#x732B;&#x4E00;&#x4E0B;&#x5B50;&#x53D8;&#x6210;&#x4E00;&#x53EA;&#x5927;&#x732B;&#x4E86;&#x3002;</p>
<p>&#x5B83;&#x662F;&#x4E00;&#x53EA;&#x5F88;&#x901A;&#x4EBA;&#x6027;&#x7684;&#x732B;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x5F88;&#x4E56;&#x6765;&#x5F62;&#x5BB9;&#x3002;&#x5728;&#x5BB6;&#x91CC;&#x4E0D;&#x6253;&#x7FFB;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#xFF0C;&#x72AF;&#x9519;&#x8BEF;&#x4F1A;&#x5F88;&#x4E3B;&#x52A8;&#x7684;&#x8BA4;&#x9519;&#x7B49;&#x5F85;&#x53D7;&#x7F5A;&#x3002;&#x867D;&#x7136;&#x5B83;&#x6CA1;&#x6709;&#x548C;&#x4EBA;&#x6C9F;&#x901A;&#x7684;&#x80FD;&#x529B;&#x4F46;&#x662F;&#x80FD;&#x770B;&#x51FA;&#x5B83;&#x4E00;&#x76F4;&#x90FD;&#x60F3;&#x548C;&#x4EBA;&#x8BF4;&#x8BDD;&#xFF0C;&#x4E00;&#x76F4;&#x90FD;&#x5728;&#x52AA;&#x529B;&#x7684;&#x60F3;&#x8868;&#x8FBE;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x3002;&#x751A;&#x81F3;&#x5B83;&#x4E00;&#x76F4;&#x90FD;&#x5728;&#x5B66;&#x4EBA;&#x7684;&#x4E00;&#x4E3E;&#x4E00;&#x52A8;&#x3002;</p>
<p>&#x5B83;&#x559C;&#x6B22;&#x5916;&#x51FA;&#x3002;&#x548C;&#x522B;&#x7684;&#x732B;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x88AB;&#x7EF3;&#x5B50;&#x6813;&#x7740;&#x6E9C;&#x3002;&#x590F;&#x5929;&#x7684;&#x65F6;&#x5019;&#x6211;&#x548C;&#x5BB6;&#x4EBA;&#x4E00;&#x8D77;&#x5728;&#x6CB3;&#x8FB9;&#x966A;&#x5B83;&#x6E9C;&#x8FBE;&#x3002;&#x5B83;&#x4E5F;&#x4E0D;&#x50CF;&#x522B;&#x7684;&#x732B;&#x90A3;&#x6837;&#x5230;&#x5904;&#x4E71;&#x8DD1;&#x3002;&#x8DEF;&#x4EBA;&#x5F88;&#x559C;&#x6B22;&#x5B83;&#x5237;&#x767D;&#x5237;&#x767D;&#x7684;&#x6BDB;&#xFF0C;&#x5728;&#x6CB3;&#x8FB9;&#x5F88;&#x663E;&#x773C;&#x3002;</p>
<p>&#x5B83;&#x7231;&#x5403;&#x732B;&#x7F50;&#x5934;&#xFF0C;&#x7ECF;&#x5E38;&#x665A;&#x4E0A;&#x7F20;&#x5728;&#x811A;&#x8FB9;&#x8981;&#x7F50;&#x5934;&#x5403;&#x3002;&#x6709;&#x65F6;&#x6211;&#x592A;&#x61D2;&#x4E86;&#x5C31;&#x61D2;&#x5F97;&#x7BA1;&#x4ED6;&#xFF0C;&#x5C31;&#x53EA;&#x7ED9;&#x5B83;&#x4E00;&#x7897;&#x732B;&#x7CAE;&#x3002;</p>
<p>&#x548C;&#x5B83;&#x76F8;&#x5904;&#x7684;&#x8FD9;&#x6BB5;&#x65E5;&#x5B50;&#x5F88;&#x6109;&#x5FEB;&#x5F88;&#x7F8E;&#x597D;&#x3002;</p>
<p>&#x6BCF;&#x5929;&#x665A;&#x4E0A;&#x653E;&#x5B66;&#x56DE;&#x5BB6;&#x90FD;&#x80FD;&#x770B;&#x5230;&#x5B83;&#x6FC0;&#x52A8;&#x7684;&#x671D;&#x4F60;&#x8DD1;&#x6765;&#xFF0C;&#x665A;&#x4E0A;&#x7761;&#x89C9;&#x5B83;&#x8FD8;&#x4F1A;&#x8DB4;&#x5728;&#x4F60;&#x7684;&#x5E8A;&#x8FB9;&#x3002;</p>
<p>&#x517B;&#x4E00;&#x53EA;&#x732B;&#x7684;&#x751F;&#x6D3B;&#x5F88;&#x522B;&#x6837;&#x7684;&#x4E30;&#x5BCC;&#x591A;&#x5F69;&#x3002;&#x5B83;&#x6539;&#x53D8;&#x4E86;&#x6211;&#x8BB8;&#x591A;&#x3002;&#x540E;&#x6765;&#x5B83;&#x4E5F;&#x5C31;&#x6210;&#x4E86;&#x6211;&#x751F;&#x547D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x4E86;&#x3002;</p>
<p>&#x732B;&#x7684;&#x601D;&#x7EF4;&#x4E5F;&#x633A;&#x7279;&#x6B8A;&#x7684;&#xFF0C;&#x548C;&#x4EBA;&#x6709;&#x5F88;&#x5927;&#x7684;&#x4E0D;&#x540C;</p>
<p>&#x6211;&#x53EF;&#x4EE5;&#x7528;&#x5F88;&#x89C4;&#x77E9;&#x6765;&#x5F62;&#x5BB9;&#x4E00;&#x4E2A;&#x732B;&#x3002;&#x5B83;&#x5728;&#x6211;&#x773C;&#x91CC;&#x6BCF;&#x5929;&#x751F;&#x6D3B;&#x5F97;&#x90FD;&#x5F88;&#x89C4;&#x77E9;&#xFF0C;&#x5B9A;&#x65F6;&#x5B9A;&#x70B9;&#x7684;&#x5E72;&#x4E00;&#x4E9B;&#x4E8B;&#xFF0C;&#x5E76;&#x4E14;&#x603B;&#x628A;&#x5B83;&#x7684;&#x4E3B;&#x4EBA;&#x5F53;&#x4EB2;&#x4EBA;&#x6765;&#x5BF9;&#x5F85;&#x5427;&#x3002;</p>
<p>&#x6BCF;&#x5929;&#x4E0A;&#x5B66;&#x540E;&#x90FD;&#x80FD;&#x542C;&#x5230;&#x51E0;&#x58F0;&#x5B83;&#x72EC;&#x81EA;&#x5728;&#x5BB6;&#x4E2D;&#x54ED;&#x568E;&#x4E00;&#x822C;&#x7684;&#x53EB;&#x58F0;&#xFF0C;&#x542C;&#x7740;&#x633A;&#x63EA;&#x5FC3;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x6CA1;&#x529E;&#x6CD5;&#x3002;</p>
<p>&#x6CA1;&#x60F3;&#x5230;&#x4E00;&#x5207;&#x8FC7;&#x53BB;&#x5F97;&#x8FD9;&#x4E48;&#x5FEB;&#xFF0C;&#x751A;&#x81F3;&#x6211;&#x73B0;&#x5728;&#x8FD8;&#x96BE;&#x4EE5;&#x56DE;&#x5FC6;&#x8FC7;&#x53BB;&#x3002;</p>
<p>&#x4E00;&#x5468;&#x524D;&#x7684;&#x65E9;&#x6668;&#xFF0C;&#x5B83;&#x53BB;&#x4E16;&#x4E86;&#x3002;</p>
<p>&#x4E00;&#x77AC;&#x95F4;&#x89C9;&#x5F97;&#x8FD9;&#x548C;&#x6211;&#x60F3;&#x7684;&#x6709;&#x4E9B;&#x4E0D;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x539F;&#x672C;&#x666E;&#x901A;&#x7684;&#x4E00;&#x5929;&#x4E2D;&#x5348;&#x5C31;&#x8FD9;&#x6837;&#x53D8;&#x5F97;&#x4E0D;&#x540C;&#x4E86;&#x3002;&#x4E00;&#x4E0B;&#x5348;&#x6211;&#x90FD;&#x795E;&#x6DF7;&#x98A0;&#x5012;&#x7684;&#x542C;&#x8001;&#x5E08;&#x8BB2;&#x8BFE;&#x3002;&#x8FD8;&#x662F;&#x8BF7;&#x4E86;&#x4E00;&#x8282;&#x8BFE;&#x7684;&#x5047;&#x56DE;&#x5BB6;&#x548C;&#x5BB6;&#x4EBA;&#x4E00;&#x8D77;&#x628A;&#x5B83;&#x5E26;&#x5230;&#x5927;&#x51CC;&#x6CB3;&#x8FB9;&#x57CB;&#x8D77;&#x6765;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x9009;&#x62E9;&#x4E86;&#x6C89;&#x9ED8;&#x8D77;&#x6765;&#xFF0C;&#x6CA1;&#x6709;&#x548C;&#x4EFB;&#x4F55;&#x4EBA;&#x8BF4;&#x8FD9;&#x4EF6;&#x4E8B;&#x3002;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x4E0D;&#x88AB;&#x8FD9;&#x60B2;&#x4F24;&#x56F0;&#x6270;&#x7740;&#x3002;&#x4E2D;&#x5348;&#x5728;&#x5BB6;&#x5E26;&#x4E0A;&#x8033;&#x673A;&#x60F3;&#x8BA9;&#x81EA;&#x5DF1;&#x9759;&#x4E0B;&#x6765;&#xFF0C;&#x4F46;&#x662F;&#x773C;&#x6CEA;&#x5C31;&#x6291;&#x5236;&#x4E0D;&#x4F4F;&#x7684;&#x5F80;&#x5916;&#x6D41;&#x3002;&#x5FC3;&#x91CC;&#x8FD8;&#x662F;&#x90A3;&#x4E48;&#x7684;&#x820D;&#x4E0D;&#x5F97;&#xFF0C;&#x6CA1;&#x6709;&#x544A;&#x522B;&#x7684;&#x5C31;&#x8FD9;&#x4E48;&#x79BB;&#x53BB;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x7F13;&#x4E86;&#x597D;&#x957F;&#x597D;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x5728;&#x5B66;&#x6821;&#x91CC;&#x4E0D;&#x613F;&#x591A;&#x8BF4;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x5728;&#x5BB6;&#x91CC;&#x4E0D;&#x6562;&#x60F3;&#x592A;&#x591A;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x7A0D;&#x5FAE;&#x6709;&#x4E9B;&#x5BB3;&#x6015;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x5B64;&#x72EC;&#x3002;&#x4E4B;&#x524D;&#x6BCF;&#x5929;&#x56DE;&#x5BB6;&#x90FD;&#x4F1A;&#x4E60;&#x60EF;&#x6027;&#x7684;&#x558A;&#x51E0;&#x58F0;&#x5B83;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x53C8;&#x8981;&#x60F3;&#x65B9;&#x8BBE;&#x6CD5;&#x7684;&#x63A7;&#x5236;&#x81EA;&#x5DF1;&#x4E0D;&#x8981;&#x8FD9;&#x4E48;&#x505A;&#x3002;</p>
<p>&#x8003;&#x8651;&#x4E86;&#x5F88;&#x4E45;&#x51B3;&#x5B9A;&#x5199;&#x70B9;&#x4EC0;&#x4E48;&#x6765;&#x7EAA;&#x5FF5;&#x4E00;&#x4E0B;&#x8FD9;&#x53EA;&#x966A;&#x4F34;&#x4E86;&#x6211;&#x51E0;&#x4E2A;&#x6708;&#x7684;&#x732B;&#x54AA;&#x3002;&#x7684;&#x786E;&#xFF0C;&#x6211;&#x6CA1;&#x60F3;&#x5230;&#x8FD9;&#x4E48;&#x5FEB;&#x5931;&#x53BB;&#x5B83;&#x3002;&#x5C3D;&#x7BA1;&#x8FC7;&#x53BB;&#x534A;&#x4E2A;&#x6708;&#x4E86;&#x4F46;&#x6211;&#x4ECD;&#x80FD;&#x68A6;&#x5230;&#x548C;&#x5B83;&#x4E00;&#x8D77;&#x73A9;&#x800D;&#x65F6;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x603B;&#x89C9;&#x5F97;&#x5B83;&#x8FD8;&#x6D3B;&#x7740;&#x3002;</p>
<p>&#x603B;&#x89C9;&#x5F97;&#x6CA1;&#x6709;&#x548C;&#x5B83;&#x8BF4;&#x518D;&#x89C1;&#xFF0C;&#x68A6;&#x91CC;&#x68A6;&#x89C1;&#x5B83;&#x8FD8;&#x662F;&#x6D3B;&#x8E66;&#x4E71;&#x8DF3;&#x7684;&#x548C;&#x6211;&#x95F9;&#x3002;&#x4E00;&#x5207;&#x5C31;&#x50CF;&#x68A6;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x544A;&#x8BC9;&#x81EA;&#x5DF1;&#x90A3;&#x53EA;&#x662F;&#x4E00;&#x573A;&#x68A6;&#x3002;&#x5728;&#x68A6;&#x91CC;&#x548C;&#x5B83;&#x8BF4;&#x518D;&#x89C1;&#x5427;&#xFF0C;&#x8FD9;&#x4E00;&#x5207;&#x53EA;&#x80FD;&#x5728;&#x68A6;&#x91CC;&#x5B8C;&#x6210;&#x4E86;&#xFF0C;&#x68A6;&#x662F;&#x90A3;&#x4E48;&#x7684;&#x771F;&#x5B9E;&#xFF0C;&#x603B;&#x7ED9;&#x6211;&#x4E00;&#x79CD;&#x9519;&#x89C9;&#x3002;&#x800C;&#x771F;&#x6B63;&#x7684;&#x73B0;&#x5B9E;&#x5374;&#x88AB;&#x6211;&#x5F53;&#x4F5C;&#x68A6;&#x5883;&#x53BB;&#x9762;&#x5BF9;&#x4E86;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x51E0;&#x5929;&#x53C8;&#x8981;&#x8003;&#x8BD5;&#x4E86;&#xFF0C;&#x800C;&#x8FD9;&#x6B21;&#x6211;&#x771F;&#x7684;&#x89C9;&#x5F97;&#x7D2F;&#x4E86;&#x3002;&#x770B;&#x5230;&#x73ED;&#x7EA7;&#x540C;&#x5B66;&#x90FD;&#x5728;&#x4F7F;&#x52B2;&#x7684;&#x5728;&#x8BFE;&#x4E0A;&#x5B66;&#x7740;&#xFF0C;&#x800C;&#x6211;&#x60F3;&#x6B47;&#x4E00;&#x6B47;&#x3002;&#x5148;&#x627E;&#x51E0;&#x672C;&#x4E66;&#x770B;&#x4E00;&#x4E0B;&#x5427;&#xFF0C;&#x603B;&#x611F;&#x89C9;2016&#x5E74;&#x7684;&#x4E0B;&#x534A;&#x5E74;&#x5927;&#x8111;&#x4E00;&#x76F4;&#x5904;&#x5728;&#x6DF7;&#x6C8C;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x4E1D;&#x6BEB;&#x6CA1;&#x6709;&#x6E05;&#x9192;&#x8FC7;&#xFF0C;&#x505A;&#x4E8B;&#x60C5;&#x7684;&#x52A8;&#x673A;&#x4E5F;&#x6CA1;&#x6709;&#x4E86;&#xFF0C;&#x4E00;&#x70B9;&#x90FD;&#x4E0D;&#x50CF;&#x5E74;&#x521D;&#x65F6;&#x7684;&#x81EA;&#x5DF1;&#x4E86;&#x3002;&#x968F;&#x7740;&#x81EA;&#x5DF1;&#x6700;&#x559C;&#x6B22;&#x7684;&#x90A3;&#x9996;&#x6B4C;&#x542C;&#x817B;&#x4E86;&#xFF0C;&#x5C31;&#x5728;&#x4E5F;&#x6CA1;&#x627E;&#x5230;&#x66F4;&#x597D;&#x542C;&#x7684;&#x6B4C;&#x6765;&#x5524;&#x9192;&#x5927;&#x8111;&#x7684;&#x6DF1;&#x5904;&#x3002;&#x800C;&#x5E74;&#x672B;&#x53C8;&#x53D1;&#x751F;&#x4E86;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x3002;&#x6211;&#x4E0D;&#x5F97;&#x4E0D;&#x597D;&#x597D;&#x7684;&#x60F3;&#x60F3;&#xFF0C;&#x6211;&#x5230;&#x5E95;&#x9057;&#x5FD8;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x8EAB;&#x4F53;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x7684;&#x7D2F;&#xFF0C;&#x5FD9;&#x6D3B;&#x4E86;&#x4E00;&#x5207;&#x7A76;&#x7ADF;&#x6362;&#x56DE;&#x6765;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x5C3D;&#x7BA1;&#x6CA1;&#x6709;&#x540E;&#x6094;&#x8FC7;&#x4F46;&#x662F;&#x771F;&#x7684;&#x597D;&#x7D2F;&#x597D;&#x7D2F;&#x3002;&#x8FD9;&#x4E0D;&#x662F;&#x6211;&#x7ED9;&#x81EA;&#x5DF1;&#x89C4;&#x5212;&#x7684;&#x751F;&#x6D3B;&#x3002;
&#x5E26;&#x8033;&#x673A;&#x628A;&#x8FD9;&#x4E9B;&#x4E00;&#x70B9;&#x70B9;&#x7684;&#x5199;&#x51FA;&#x6765;&#xFF0C;&#x4E5F;&#x8BB8;&#x5199;&#x51FA;&#x6765;&#x5FC3;&#x91CC;&#x5C31;&#x4F1A;&#x597D;&#x53D7;&#x4E86;&#x5427;&#x3002;</p>
<p>&#x6709;&#x4E9B;&#x4E8B;&#x6CA1;&#x529E;&#x6CD5;&#x6309;&#x7167;&#x81EA;&#x5DF1;&#x6240;&#x60F3;&#x7684;&#x90A3;&#x6837;&#x53BB;&#x8FDB;&#x884C;&#xFF0C;&#x81EA;&#x5DF1;&#x6240;&#x60F3;&#x7684;&#x548C;&#x5B9E;&#x9645;&#x53D1;&#x751F;&#x7684;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x8DDD;&#x603B;&#x662F;&#x90A3;&#x4E48;&#x5927;&#xFF0C;&#x4E5F;&#x8BB8;&#x8FD9;&#x5C31;&#x662F;&#x751F;&#x6D3B;&#x5427;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x7F18;&#x4EFD;&#x5427;&#xFF0C;&#x6211;&#x60F3;&#x3002;</p>
<p>&#x611F;&#x8C22;&#x5B83;&#x966A;&#x4F34;&#x6211;&#x7684;&#x8FD9;4&#x4E2A;&#x6708;&#x3002;&#x5FC3;&#x91CC;&#x60F3;&#x7740;&#x6709;&#x4E9B;&#x5BF9;&#x4E0D;&#x8D77;&#x5B83;&#xFF0C;&#x4F46;&#x662F;&#x53C8;&#x6CA1;&#x529E;&#x6CD5;&#x633D;&#x56DE;&#x4E86;&#x3002;</p>
<p>&#x9759;&#x9759;&#x7684;&#x5728;&#x5FC3;&#x91CC;&#x60F3;&#xFF1A;&#x8C22;&#x8C22;&#xFF0C;&#x5BF9;&#x4E0D;&#x8D77;&#x3002;</p>
<p>&#x4E00;&#x5207;&#x8FC7;&#x53BB;&#x7684;&#x597D;&#x5FEB;&#xFF0C;&#x6BCF;&#x5929;&#x8FD8;&#x662F;&#x8981;&#x9762;&#x5BF9;&#x7740;&#x65B0;&#x7684;&#x4E00;&#x5207;&#xFF0C;&#x8FD8;&#x8981;&#x53BB;&#x4E0A;&#x5B66;&#xFF0C;&#x8FD8;&#x8981;&#x6709;&#x7406;&#x60F3;&#x3002;&#x91CD;&#x65B0;&#x89C4;&#x5212;&#x4E00;&#x4E0B;&#x672A;&#x6765;&#xFF0C;&#x628A;&#x6CA1;&#x5FC5;&#x8981;&#x7684;&#x6570;&#x636E;&#x90FD;&#x6E05;&#x7406;&#x6389;&#xFF0C;&#x7ED9;&#x5927;&#x8111;&#x4E00;&#x5468;&#x7684;&#x5047;&#x671F;&#x3002;&#x4E00;&#x5207;&#x8FD8;&#x5728;&#x7EE7;&#x7EED;&#x3002;</p>
<p>&#x770B;&#x5230;AlanWalker&#x7EC8;&#x4E8E;&#x53D1;&#x5E03;&#x65B0;&#x66F2;&#x4E86;&#xFF0C;&#x975E;&#x5E38;&#x6FC0;&#x52A8;&#x7684;&#x6234;&#x8033;&#x673A;&#x53BB;&#x542C;&#x3002;&#x770B;&#x5230;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6709;&#x7406;&#x60F3;&#xFF0C;&#x4E00;&#x76F4;&#x52AA;&#x529B;&#x7684;&#x4EBA;&#x771F;&#x597D;&#x3002;</p>
<p>&#x4E00;&#x7728;&#x773C;2016&#x4E5F;&#x5C31;&#x8FD9;&#x4E48;&#x8FC7;&#x53BB;&#x4E86;&#x3002;&#x7AD9;&#x5728;2017&#x56DE;&#x9996;&#x8FC7;&#x53BB;&#x4E00;&#x5E74;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x53D8;&#x4E86;&#x597D;&#x591A;&#xFF0C;&#x7ECF;&#x5386;&#x4E86;&#x597D;&#x591A;&#x7684;&#x4E8B;&#x3002;&#x8BA4;&#x8BC6;&#x4E86;&#x597D;&#x591A;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x7684;&#x751F;&#x6D3B;&#x4E5F;&#x5C31;&#x8FD9;&#x4E48;&#x4E00;&#x70B9;&#x70B9;&#x7684;&#x88AB;&#x4ED6;&#x4EEC;&#x5F71;&#x54CD;&#x7740;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x4E0D;&#x597D;&#xFF0C;&#x867D;&#x7136;&#x7D2F;&#x70B9;&#x4F46;&#x662F;&#x4E00;&#x5207;&#x8FD8;&#x662F;&#x503C;&#x5F97;&#x53BB;&#x8D70;&#x7684;&#x3002;&#x9AD8;&#x4E2D;&#x751F;&#x6D3B;&#x8FC7;&#x53BB;&#x4E00;&#x534A;&#x4E86;&#xFF0C;&#x771F;&#x7684;&#x5F88;&#x5FEB;&#x554A;&#xFF0C;&#x6216;&#x8BB8;&#x5230;&#x4E86;&#x9AD8;&#x4E09;&#x65F6;&#x95F4;&#x4F1A;&#x8FC7;&#x5F97;&#x66F4;&#x5FEB;&#x5427;&#x3002;&#x8981;&#x5B66;&#x4F1A;&#x73CD;&#x60DC;&#xFF0C;&#x8981;&#x591A;&#x548C;&#x73B0;&#x5728;&#x8FD8;&#x5B58;&#x5728;&#x7684;&#x4EBA;&#x548C;&#x4E8B;&#x5F85;&#x4E00;&#x4F1A;&#x513F;&#x3002;&#x4E00;&#x65E6;&#x81EA;&#x5DF1;&#x53D1;&#x73B0;&#x6211;&#x5DF2;&#x7ECF;&#x5931;&#x53BB;&#x4E86;&#x4EC0;&#x4E48;&#x6539;&#x53D8;&#x4E0D;&#x56DE;&#x6765;&#x65F6;&#xFF0C;&#x5C31;&#x90FD;&#x665A;&#x4E86;&#x3002;</p>
<p>&#x8BF4;&#x5B9E;&#x8BDD;&#x6211;&#x89C9;&#x5F97;&#x6211;&#x6027;&#x683C;&#x5F88;&#x5927;&#x5927;&#x54A7;&#x54A7;&#x7684;&#x9A6C;&#x9A6C;&#x864E;&#x864E;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x73ED;&#x91CC;&#x5374;&#x5F88;&#x5B85;&#x7684;&#x6837;&#x5B50;&#x90FD;&#x4E0D;&#x662F;&#x5F88;&#x613F;&#x610F;&#x8BF4;&#x8BDD;&#x3002;&#x6211;&#x627E;&#x4E0D;&#x5230;&#x522B;&#x7684;&#x5F62;&#x5BB9;&#x81EA;&#x5DF1;&#x7684;&#x8BCD;&#x4E86;&#xFF0C;&#x611F;&#x89C9;&#x8BF4;&#x81EA;&#x5DF1;&#x4E8C;&#x4E00;&#x70B9;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x4E0D;&#x59A5;&#x7684;&#x3002;&#x53EF;&#x80FD;&#x662F;&#x6211;&#x6709;&#x65F6;&#x5019;&#x758F;&#x5FFD;&#x5927;&#x610F;&#x4E86;&#x5427;&#xFF0C;&#x5FFD;&#x7565;&#x6389;&#x4E86;&#x8EAB;&#x8FB9;&#x597D;&#x591A;&#x5BF9;&#x6211;&#x597D;&#x7684;&#x4EBA;&#xFF0C;&#x8FD8;&#x72AF;&#x4E0B;&#x4E86;&#x597D;&#x591A;&#x6539;&#x4E0D;&#x4E86;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x6709;&#x65F6;&#x5019;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x86EE;&#x806A;&#x660E;&#x7684;&#x7136;&#x540E;&#x81EA;&#x5DF1;&#x56FA;&#x6267;&#x5230;&#x4E86;&#x72AF;&#x4E86;&#x9519;&#x8BEF;&#x90FD;&#x4E0D;&#x613F;&#x610F;&#x627E;&#x539F;&#x56E0;&#x7684;&#x5730;&#x6B65;&#xFF0C;&#x7136;&#x540E;&#x81EA;&#x5DF1;&#x5C31;&#x9677;&#x5728;&#x8FD9;&#x91CC;&#x8D8A;&#x6765;&#x8D8A;&#x6DF1;&#x4E86;&#x3002;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x4E00;&#x76F4;&#x90FD;&#x662F;&#x5728;&#x62C6;&#x4E86;&#x4E1C;&#x5899;&#x8865;&#x897F;&#x5899;&#x90A3;&#x6837;&#x7684;&#x751F;&#x6D3B;&#x7740;&#xFF0C;&#x7EF4;&#x62A4;&#x8D77;&#x7F51;&#x7AD9;&#x4E86;&#x5C31;&#x5F00;&#x59CB;&#x9057;&#x5F03;&#x7528;&#x4E86;&#x591A;&#x5E74;&#x7684;QQ&#x7A7A;&#x95F4;&#x4E86;&#xFF0C;&#x4E00;&#x9047;&#x5230;&#x70B9;&#x65B0;&#x9C9C;&#x4E8B;&#x5C31;&#x628A;&#x8111;&#x5B50;&#x91CC;&#x522B;&#x7684;&#x4E1C;&#x897F;&#x5168;&#x5FD8;&#x6389;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x81EA;&#x5DF1;&#x5C31;&#x8FD9;&#x4E48;&#x770B;&#x4F3C;&#x5B8C;&#x7F8E;&#x7684;&#x4E00;&#x5929;&#x5929;&#x7684;&#x8D70;&#x4E0B;&#x53BB;&#x4E86;&#x3002;  </p>
<p>&#x53EF;&#x80FD;&#x8FD8;&#x9700;&#x8981;&#x7ECF;&#x5386;&#x5F88;&#x4E45;&#x6211;&#x5728;&#x80FD;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x6BDB;&#x75C5;&#x6539;&#x8FC7;&#x6765;&#x5427;&#xFF0C;&#x6216;&#x8BB8;&#x5F88;&#x4E45;&#x4EE5;&#x540E;&#x6211;&#x4E5F;&#x610F;&#x8BC6;&#x4E0D;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x6BDB;&#x75C5;&#x3002;</p>
<p>&#x4E24;&#x4E2A;&#x6708;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x671F;&#x672B;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x6625;&#x8282;&#x5373;&#x5C06;&#x6765;&#x4E34;&#x4E86;&#x3002;&#x6709;&#x65F6;&#x5019;&#x6211;&#x8FD8;&#x4F1A;&#x4E0D;&#x7531;&#x81EA;&#x4E3B;&#x7684;&#x95EE;&#x81EA;&#x5DF1;&#x6211;&#x517B;&#x8FC7;&#x90A3;&#x53EA;&#x732B;&#x5417;&#xFF1F;&#x5B83;&#x6B7B;&#x4E86;&#x5417;&#xFF1F;&#x53D1;&#x751F;&#x8FC7;&#x4E86;&#x4EC0;&#x4E48;&#x5417;&#xFF1F;&#xB7;&#xB7;&#xB7;&#xB7;&#xB7;&#xB7;&#x4E5F;&#x8BB8;&#x4E00;&#x4E2A;&#x4EBA;&#x771F;&#x7684;&#x88AB;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#x4F24;&#x5230;&#x4E86;&#x5F71;&#x54CD;&#x5230;&#x4E86;&#x4ED6;&#x7684;&#x6B63;&#x5E38;&#x751F;&#x6D3B;&#x540E;&#xFF0C;&#x4ED6;&#x7684;&#x5927;&#x8111;&#x5C31;&#x4F1A;&#x63A7;&#x5236;&#x4ED6;&#x81EA;&#x5DF1;&#x4E0D;&#x987E;&#x4E00;&#x5207;&#x7684;&#x5FD8;&#x6389;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x3002;&#x6240;&#x4EE5;&#x73B0;&#x5728;&#x6211;&#x5F7B;&#x5E95;&#x7684;&#x5FD8;&#x6389;&#x4E86;&#x4ED6;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x76EF;&#x7740;&#x7A97;&#x6237;&#x4E0A;&#x7684;&#x5835;&#x6B7B;&#x7684;&#x732B;&#x6D1E;&#x4F1A;&#x53D1;&#x5446;&#x5F88;&#x4E45;&#x624D;&#x80FD;&#x60F3;&#x8D77;&#x6765;&#x8FD9;&#x662F;&#x5E72;&#x4EC0;&#x4E48;&#x7528;&#x7684;&#xFF0C;&#x56DE;&#x770B;&#x4ED6;&#x7684;&#x7167;&#x7247;&#x65F6;&#x4F1A;&#x611F;&#x5230;&#x5F88;&#x964C;&#x751F;&#x4E00;&#x6837;&#x95EE;&#x81EA;&#x5DF1;&#xFF0C;&#x8FD9;&#x53EA;&#x732B;&#x597D;&#x53EF;&#x7231;&#x554A;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4E00;&#x70B9;&#x548C;&#x4ED6;&#x719F;&#x6089;&#x7684;&#x611F;&#x89C9;&#x90FD;&#x6CA1;&#x6709;&#x4E86;&#x5462;&#x3002;</p>
<p>&#x611F;&#x8C22;&#x5728;&#x751F;&#x547D;&#x4E2D;&#x9047;&#x89C1;&#x4E86;&#x5B83;&#xFF0C;&#x4E00;&#x5207;&#x6765;&#x7684;&#x5FEB;&#x53BB;&#x7684;&#x4E5F;&#x5FEB;&#x3002;</p>
<p><img src="/posts/sorry-thankyou/images/thankyou.jpg" alt="Thankyou"></p>
<blockquote>
<p>&#x591C;&#x6DF1;&#x4E86;&#xFF0C;&#x53C8;&#x4E00;&#x6B21;&#x66F4;&#x65B0;&#x7740;&#x8FD9;&#x7BC7;&#x611F;&#x60C5;&#x4EA4;&#x9519;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x8FC7;&#x53BB;&#x597D;&#x4E45;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x53D1;&#x73B0;&#x6709;&#x4E9B;&#x4E8B;&#x53D1;&#x751F;&#x8FC7;&#x4E86;&#xFF0C;&#x5C31;&#x518D;&#x4E5F;&#x56DE;&#x4E0D;&#x53BB;&#x4E86;&#x3002;</p>
</blockquote>
<br>
<br>
<br>

<h1 id="SorryThankyou"><a class="headerlink" href="/posts/sorry-thankyou/#SorryThankyou" title="SorryThankyou"></a>Sorry,Thankyou.</h1>
<br>

    </main>
    <footer class="post-footer">
      
      <div class="post-tags">
        <a class="post-tag button" href="/tags/%E7%90%90%E4%BA%8B/" rel="tag"><i class="fas fa-tag"></i>琐事</a><a class="post-tag button" href="/tags/%E9%AB%98%E4%B8%AD/" rel="tag"><i class="fas fa-tag"></i>高中</a>
      </div>
      
    </footer>
  </article>
  
  <nav class="page-nav">
    <div class="page-nav-next page-nav-item">
      
      <a href="/posts/Hello-2017/" rel="next" title="Hello 2017!"><i class="fas fa-angle-left"></i><span class="nav-title">Hello 2017!</span></a>
      
    </div>
    <div class="page-nav-prev page-nav-item">
      
      <a href="/posts/raspberrypi-mc-server/" rel="prev" title="树莓派之我的世界服务器"><span class="nav-title">树莓派之我的世界服务器</span><i class="fas fa-angle-right"></i></a>
      
    </div>
  </nav>
  
  
<div class="reward" id="reward">
  <p>自动售卖机卖的摩卡咖啡超好喝！！</p>
  <button id="reward-button" class="button" disable="enable"><i class="fas fa-donate"></i>Reward</button>
  <div id="qr" class="qr" style="display: none;" aria-hidden="true">
    
    <div id="wechat">
      <img id="wechat_qr" src="/images/wechat.jpg" alt="WechatPay"/>
      <span>WechatPay</span>
    </div>
    
    
    <div id="alipay">
      <img id="alipay_qr" src="/images/alipay.jpg" alt="AliPay"/>
      <span>AliPay</span>
    </div>
    
    
  </div>
</div>


  
  
  
  

<div class="comments" id="comments">
  
  <div class="commentjs" id="comment-thread"></div>
  <link rel="stylesheet" href="/css/commentjs.css">
  <script defer type="text/javascript" src="/js/marked.min.js"></script>
  <script defer type="text/javascript" src="/js/timeago.min.js"></script>
  <script defer type="text/javascript" src="/js/highlight.min.js"></script>
  <script defer type="text/javascript" src="/js/commentjs.js"></script>
  <script type="text/javascript">
  $(document).ready(function () {
    getComments({
      "type": "github",
      "user": "STARRY-S",
      "repo": "blog.starry-s.xyz",
      "clientID": "d840b2424099ff5195ff",
      "clientSecret": "cc22cbdcdee59b64ef1031c4d369821030b3634f",
      "no_comment": "This page has no comment, go to comment now!",
      "go_to_comment": "Go to Comment",
      "issue_title": "Sorry & Thankyou.",
      "btn_class": "button",
      "comments_target": "#comment-thread"
    });
    marked.setOptions({
      "highlight": function (code, lang) {
        return hljs.highlightAuto(code).value;
      }
    });
    function mark() {
      var markdowns = document.getElementsByClassName("markdown");
      for (var i = 0; i < markdowns.length; ++i){
        if (markdowns[i].innerHTML) {
          markdowns[i].innerHTML = marked(markdowns[i].innerHTML);
        }
      }
    }
    window.addEventListener("DOMContentLoaded", mark, false);
    window.addEventListener("load", mark, false);
  });
  </script>
  
</div>



  
</div>

          </div>
          
          
          
<aside class="sidebar" id="sidebar" style="background: url(/images/background.png);">
  
  <div class="search">
    <div class="form-group">
      <i class="fas fa-search"></i><input type="search" id="search-input" name="q" results="0" placeholder="Search" class="form-control"/>
    </div>
  </div>
  <div class="search-result-box" id="search-result"></div>
  
  
<div class="info sidebar-item" id="info">
  
  <img class="author-avatar" src="/images/avatar.png" alt="STARRY-S">
  
  <h1 class="author-name">STARRY-S</h1>
  <h2 class="author-description"></h2>
  <div class="site-count">
    
    
    
    
    <div class="archives-count count-block">
      <div class="site-count-title">Archives</div>
      <div><a href="/archives/">18</a></div>
    </div>
    
    
    
    <div class="categories-count count-block">
      <div class="site-count-title">Categories</div>
      <div><a href="/categories/">15</a></div>
    </div>
    
    
    
    <div class="tags-count count-block">
      <div class="site-count-title">Tags</div>
      <div><a href="/tags/">25</a></div>
    </div>
    
    
    
    
  </div>
  
  <div class="rss">
    <a class="rss-link button sidebar-item" href="/atom.xml"><i class="fas fa-rss"></i>RSS</a>
  </div>
  
</div>


  <div class="sidebar-sticky">
    
    
    <hr>
    <div class="post-toc sidebar-item" id="toc-div">
      <div><i class="fas fa-list-ol"></i>Table of Contents</div>
      <div class="post-toc-content">
        
        
        <ol class="list-group toc">
        
          <li>
            <a class="list-group-item toc-link" href="#SorryThankyou">Sorry,Thankyou.</a>
            
          </li>
        
        </ol>
        
      </div>
    </div>
    
    
    
    <hr>
    <div class="social-link sidebar-item">
      <div><i class="far fa-address-card"></i>Social Links</p></div>
      <ul>
        
        <li><i class="fas fa-envelope"></i><a href="mailto:hx916584160@gmail.com" target="_blank">E-Mail</a></li>
        
        <li><i class="fab fa-github"></i><a href="https://github.com/STARRY-S" target="_blank">GitHub</a></li>
        
        <li><i class="fab fa-telegram"></i><a href="https://t.me/STARRY-S" target="_blank">Telegram</a></li>
        
      </ul>
    </div>
    
    
    <hr>
    <div class="blogroll sidebar-item">
      <div><i class="fas fa-user-friends"></i>Blogroll</div>
      <ul>
        
        <li><i class="fas fa-link"></i><a href="https://alynx.xyz/" target="_blank">喵's HomePage</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://chenxy.moe" target="_blank">Art_Chen's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://lgiki.cc" target="_blank">LGiki's Blog</a></li>
        
      </ul>
    </div>
    
  </div>
</aside>


          
        </div>
      </div>
    </main>
    
<footer id="footer" class="footer" style="background: #33363b;">
  <div class="container">
    <div class="back-to-top">
      <button id="back-to-top"><i class="fas fa-angle-double-up" aria-label="Back to Top"></i></button>
    </div>
    <div class="footer-container">
      <div class="footer-left">
        <div class="copyright">
          <span class="author"><i class="far fa-edit"></i>STARRY-S</span><span class="years"><i class="far fa-copyright"></i><span id="years-text">2016</span></span><span class="creative-commons"><i class="fab fa-creative-commons"></i><a href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">BY-NC-SA 4.0</a></span>
        </div>
        
        <div class="busuanzi">
          <span id="busuanzi_container_site_pv"><i class="fas fa-eye" aria-label="Site Visit Count" aria-hidden="false"></i><span id="busuanzi_value_site_pv"></span></span><span id="busuanzi_container_site_uv"><i class="fas fa-user" aria-label="Site User Count" aria-hidden="false"></i><span id="busuanzi_value_site_uv"></span></span><span id="busuanzi_container_page_pv"><i class="fas fa-file-alt"></i><span id="busuanzi_value_page_pv" aria-label="Page Click Count" aria-hidden="false"></span></span>
        </div>
        
      </div>
      <div class="footer-right">
        <div class="custom-info">
          
          Powered by<i class="fab fa-github-alt"></i><a href="https://pages.github.com/" target="_blank">Github Pages</a>
          
        </div>
        <div class="powered-by">
          Proudly Powered by <a href="https://github.com/AlynxZhou/hikaru/" target="_blank">Hikaru</a><i class="fab fa-node-js"></i>Theme is <a href="https://github.com/AlynxZhou/hikaru-theme-aria/" target="_blank">ARIA</a>
        </div>
      </div>
    </div>
  </div>
</footer>


  </body>
</html>
<!-- Page built by Hikaru v1.13.3 at 2019-02-20 Wed 15:22:23 CST. -->
